local config = {
	[1] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 1,
		page3name = "红宝石2级",
		product = {
			[1] = {
				[1] = 8000102,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000101,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[2] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 2,
		page3name = "红宝石3级",
		product = {
			[1] = {
				[1] = 8000103,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000102,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[3] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 3,
		page3name = "红宝石4级",
		product = {
			[1] = {
				[1] = 8000104,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000103,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[4] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 4,
		page3name = "红宝石5级",
		product = {
			[1] = {
				[1] = 8000105,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[5] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 5,
		page3name = "红宝石6级",
		product = {
			[1] = {
				[1] = 8000106,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000105,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[6] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 6,
		page3name = "红宝石7级",
		product = {
			[1] = {
				[1] = 8000107,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000106,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[7] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 1,
		page2name = "红宝石",
		page3 = 7,
		page3name = "红宝石8级",
		product = {
			[1] = {
				[1] = 8000108,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000107,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[8] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 1,
		page3name = "黄宝石2级",
		product = {
			[1] = {
				[1] = 8000202,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000201,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[9] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 2,
		page3name = "黄宝石3级",
		product = {
			[1] = {
				[1] = 8000203,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000202,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[10] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 3,
		page3name = "黄宝石4级",
		product = {
			[1] = {
				[1] = 8000204,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000203,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[11] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 4,
		page3name = "黄宝石5级",
		product = {
			[1] = {
				[1] = 8000205,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000204,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[12] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 5,
		page3name = "黄宝石6级",
		product = {
			[1] = {
				[1] = 8000206,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000205,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[13] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 6,
		page3name = "黄宝石7级",
		product = {
			[1] = {
				[1] = 8000207,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000206,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[14] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 2,
		page2name = "黄宝石",
		page3 = 7,
		page3name = "黄宝石8级",
		product = {
			[1] = {
				[1] = 8000208,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000207,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[15] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 1,
		page3name = "绿宝石2级",
		product = {
			[1] = {
				[1] = 8000302,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000301,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[16] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 2,
		page3name = "绿宝石3级",
		product = {
			[1] = {
				[1] = 8000303,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000302,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[17] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 3,
		page3name = "绿宝石4级",
		product = {
			[1] = {
				[1] = 8000304,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000303,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[18] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 4,
		page3name = "绿宝石5级",
		product = {
			[1] = {
				[1] = 8000305,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000304,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[19] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 5,
		page3name = "绿宝石6级",
		product = {
			[1] = {
				[1] = 8000306,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000305,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[20] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 6,
		page3name = "绿宝石7级",
		product = {
			[1] = {
				[1] = 8000307,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000306,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[21] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 3,
		page2name = "绿宝石",
		page3 = 7,
		page3name = "绿宝石8级",
		product = {
			[1] = {
				[1] = 8000308,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000307,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[22] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 4,
		page2name = "珊瑚石",
		page3 = 1,
		page3name = "珊瑚石2级",
		product = {
			[1] = {
				[1] = 8000402,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000401,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[23] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 4,
		page2name = "珊瑚石",
		page3 = 2,
		page3name = "珊瑚石3级",
		product = {
			[1] = {
				[1] = 8000403,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000402,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[24] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 4,
		page2name = "珊瑚石",
		page3 = 3,
		page3name = "珊瑚石4级",
		product = {
			[1] = {
				[1] = 8000404,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000403,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[25] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 4,
		page2name = "珊瑚石",
		page3 = 4,
		page3name = "珊瑚石5级",
		product = {
			[1] = {
				[1] = 8000405,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000404,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[26] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 5,
		page2name = "琉璃石",
		page3 = 1,
		page3name = "琉璃石2级",
		product = {
			[1] = {
				[1] = 8000502,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000501,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[27] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 5,
		page2name = "琉璃石",
		page3 = 2,
		page3name = "琉璃石3级",
		product = {
			[1] = {
				[1] = 8000503,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000502,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[28] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 5,
		page2name = "琉璃石",
		page3 = 3,
		page3name = "琉璃石4级",
		product = {
			[1] = {
				[1] = 8000504,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000503,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[29] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 5,
		page2name = "琉璃石",
		page3 = 4,
		page3name = "琉璃石5级",
		product = {
			[1] = {
				[1] = 8000505,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000504,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[30] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 6,
		page2name = "琥珀石",
		page3 = 1,
		page3name = "琥珀石2级",
		product = {
			[1] = {
				[1] = 8000602,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000601,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[31] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 6,
		page2name = "琥珀石",
		page3 = 2,
		page3name = "琥珀石3级",
		product = {
			[1] = {
				[1] = 8000603,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000602,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[32] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 6,
		page2name = "琥珀石",
		page3 = 3,
		page3name = "琥珀石4级",
		product = {
			[1] = {
				[1] = 8000604,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000603,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[33] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 6,
		page2name = "琥珀石",
		page3 = 4,
		page3name = "琥珀石5级",
		product = {
			[1] = {
				[1] = 8000605,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000604,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[34] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 7,
		page2name = "玛瑙石",
		page3 = 1,
		page3name = "玛瑙石2级",
		product = {
			[1] = {
				[1] = 8000702,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000701,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[35] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 7,
		page2name = "玛瑙石",
		page3 = 2,
		page3name = "玛瑙石3级",
		product = {
			[1] = {
				[1] = 8000703,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000702,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[36] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 7,
		page2name = "玛瑙石",
		page3 = 3,
		page3name = "玛瑙石4级",
		product = {
			[1] = {
				[1] = 8000704,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000703,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[37] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 7,
		page2name = "玛瑙石",
		page3 = 4,
		page3name = "玛瑙石5级",
		product = {
			[1] = {
				[1] = 8000705,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000704,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[38] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 8,
		page2name = "红玉髓",
		page3 = 1,
		page3name = "红玉髓2级",
		product = {
			[1] = {
				[1] = 8000802,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000801,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[39] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 8,
		page2name = "红玉髓",
		page3 = 2,
		page3name = "红玉髓3级",
		product = {
			[1] = {
				[1] = 8000803,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000802,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[40] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 8,
		page2name = "红玉髓",
		page3 = 3,
		page3name = "红玉髓4级",
		product = {
			[1] = {
				[1] = 8000804,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000803,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[41] = {
		page1 = 1,
		page1name = "宝石",
		page2 = 8,
		page2name = "红玉髓",
		page3 = 4,
		page3name = "红玉髓5级",
		product = {
			[1] = {
				[1] = 8000805,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 8000804,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[42] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 1,
		page2name = "鼠",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201001,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[43] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 1,
		page2name = "鼠",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201002,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201001,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[44] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 1,
		page2name = "鼠",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201003,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201002,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[45] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 1,
		page2name = "鼠",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201004,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201003,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[46] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 1,
		page2name = "鼠",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201005,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201004,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[47] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 2,
		page2name = "牛",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201011,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[48] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 2,
		page2name = "牛",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201012,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201011,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[49] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 2,
		page2name = "牛",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201013,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201012,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[50] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 2,
		page2name = "牛",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201014,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201013,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[51] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 2,
		page2name = "牛",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201015,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201014,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[52] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 3,
		page2name = "虎",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201021,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[53] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 3,
		page2name = "虎",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201022,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201021,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[54] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 3,
		page2name = "虎",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201023,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201022,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[55] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 3,
		page2name = "虎",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201024,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201023,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[56] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 3,
		page2name = "虎",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201025,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201024,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[57] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 4,
		page2name = "兔",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201031,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[58] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 4,
		page2name = "兔",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201032,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201031,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[59] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 4,
		page2name = "兔",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201033,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201032,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[60] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 4,
		page2name = "兔",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201034,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201033,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[61] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 4,
		page2name = "兔",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201035,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201034,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[62] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 5,
		page2name = "龙",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201041,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[63] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 5,
		page2name = "龙",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201042,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 20104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[64] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 5,
		page2name = "龙",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201043,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201042,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[65] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 5,
		page2name = "龙",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201044,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201043,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[66] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 5,
		page2name = "龙",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201045,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201044,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[67] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 6,
		page2name = "蛇",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201051,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[68] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 6,
		page2name = "蛇",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201052,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201051,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[69] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 6,
		page2name = "蛇",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201053,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201052,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[70] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 6,
		page2name = "蛇",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201054,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201053,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[71] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 6,
		page2name = "蛇",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201055,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201054,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[72] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 7,
		page2name = "马",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201061,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[73] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 7,
		page2name = "马",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201062,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201061,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[74] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 7,
		page2name = "马",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201063,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201062,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[75] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 7,
		page2name = "马",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201064,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201063,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[76] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 7,
		page2name = "马",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201065,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201064,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[77] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 8,
		page2name = "羊",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201071,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[78] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 8,
		page2name = "羊",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201072,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201071,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[79] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 8,
		page2name = "羊",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201073,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201072,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[80] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 8,
		page2name = "羊",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201074,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201073,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[81] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 8,
		page2name = "羊",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201075,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201074,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[82] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 9,
		page2name = "猴",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201081,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[83] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 9,
		page2name = "猴",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201082,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201081,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[84] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 9,
		page2name = "猴",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201083,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201082,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[85] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 9,
		page2name = "猴",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201084,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201083,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[86] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 9,
		page2name = "猴",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201085,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201084,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[87] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 10,
		page2name = "鸡",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201091,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[88] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 10,
		page2name = "鸡",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201092,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201091,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[89] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 10,
		page2name = "鸡",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201093,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201092,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[90] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 10,
		page2name = "鸡",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201094,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201093,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[91] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 10,
		page2name = "鸡",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201095,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201094,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[92] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 11,
		page2name = "狗",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201101,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[93] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 11,
		page2name = "狗",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201102,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201101,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[94] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 11,
		page2name = "狗",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201103,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201102,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[95] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 11,
		page2name = "狗",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201104,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201103,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[96] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 11,
		page2name = "狗",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201105,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[97] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 12,
		page2name = "猪",
		page3 = 1,
		product = {
			[1] = {
				[1] = 201111,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[98] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 12,
		page2name = "猪",
		page3 = 2,
		product = {
			[1] = {
				[1] = 201112,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201111,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[99] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 12,
		page2name = "猪",
		page3 = 3,
		product = {
			[1] = {
				[1] = 201113,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201112,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[100] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 12,
		page2name = "猪",
		page3 = 4,
		product = {
			[1] = {
				[1] = 201114,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201113,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[101] = {
		page1 = 2,
		page1name = "生肖",
		page2 = 12,
		page2name = "猪",
		page3 = 5,
		product = {
			[1] = {
				[1] = 201115,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 201114,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[102] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 3,
		page2name = "勋章",
		page3 = 1,
		product = {
			[1] = {
				[1] = 103009,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 103008,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[103] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 3,
		page2name = "勋章",
		page3 = 2,
		product = {
			[1] = {
				[1] = 103010,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 103009,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[104] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 3,
		page2name = "勋章",
		page3 = 3,
		product = {
			[1] = {
				[1] = 103011,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 103010,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[105] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 3,
		page2name = "勋章",
		page3 = 4,
		product = {
			[1] = {
				[1] = 103012,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 103011,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[106] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 1,
		page2name = "斗笠",
		page3 = 1,
		product = {
			[1] = {
				[1] = 101609,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 101608,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[107] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 1,
		page2name = "斗笠",
		page3 = 2,
		product = {
			[1] = {
				[1] = 101610,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 101609,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[108] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 1,
		page2name = "斗笠",
		page3 = 3,
		product = {
			[1] = {
				[1] = 101611,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 101610,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[109] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 1,
		page2name = "斗笠",
		page3 = 4,
		product = {
			[1] = {
				[1] = 101612,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 101611,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[110] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 2,
		page2name = "盾牌",
		page3 = 1,
		product = {
			[1] = {
				[1] = 104809,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 104808,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[111] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 2,
		page2name = "盾牌",
		page3 = 2,
		product = {
			[1] = {
				[1] = 104810,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 104809,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[112] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 2,
		page2name = "盾牌",
		page3 = 3,
		product = {
			[1] = {
				[1] = 104811,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 104810,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[113] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 2,
		page2name = "盾牌",
		page3 = 4,
		product = {
			[1] = {
				[1] = 104812,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 104811,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[114] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 5,
		page2name = "宝石",
		page3 = 1,
		product = {
			[1] = {
				[1] = 100709,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 100708,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[115] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 5,
		page2name = "宝石",
		page3 = 2,
		product = {
			[1] = {
				[1] = 100710,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 100709,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[116] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 5,
		page2name = "宝石",
		page3 = 3,
		product = {
			[1] = {
				[1] = 100711,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 100710,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[117] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 5,
		page2name = "宝石",
		page3 = 4,
		product = {
			[1] = {
				[1] = 100712,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 100711,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[118] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 4,
		page2name = "血玉",
		page3 = 1,
		product = {
			[1] = {
				[1] = 102509,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102508,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[119] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 4,
		page2name = "血玉",
		page3 = 2,
		product = {
			[1] = {
				[1] = 102510,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102509,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[120] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 4,
		page2name = "血玉",
		page3 = 3,
		product = {
			[1] = {
				[1] = 102511,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102510,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[121] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 4,
		page2name = "血玉",
		page3 = 4,
		product = {
			[1] = {
				[1] = 102512,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102511,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[122] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 6,
		page2name = "战旗",
		page3 = 1,
		product = {
			[1] = {
				[1] = 106508,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 106507,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[123] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 6,
		page2name = "战旗",
		page3 = 2,
		product = {
			[1] = {
				[1] = 106509,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 106508,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[124] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 6,
		page2name = "战旗",
		page3 = 3,
		product = {
			[1] = {
				[1] = 106510,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 106509,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[125] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 6,
		page2name = "战旗",
		page3 = 4,
		product = {
			[1] = {
				[1] = 106511,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 106510,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[126] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 7,
		page2name = "战鼓",
		page3 = 1,
		product = {
			[1] = {
				[1] = 102808,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102807,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[127] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 7,
		page2name = "战鼓",
		page3 = 2,
		product = {
			[1] = {
				[1] = 102809,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102808,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[128] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 7,
		page2name = "战鼓",
		page3 = 3,
		product = {
			[1] = {
				[1] = 102810,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102809,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
	[129] = {
		page1 = 3,
		page1name = "神饰",
		page2 = 7,
		page2name = "战鼓",
		page3 = 4,
		product = {
			[1] = {
				[1] = 102811,
				[2] = 1,
			},
		},
		material = {
			[1] = {
				[1] = 102810,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		CGmessage = "恭喜：合成成功！",
	},
}
return config