local config = {
	[1] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 1,
		itemid = 50014,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "新人·刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[2] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 2,
		itemid = 50051,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "新人·甲",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[3] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 3,
		itemid = 50050,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "新人·衣",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[4] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 4,
		itemid = 100501,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "纵横之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[5] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 5,
		itemid = 101001,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "纵横战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[6] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 6,
		itemid = 101002,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "纵横战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[7] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 7,
		itemid = 101901,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[8] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 8,
		itemid = 102201,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横戒指[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[9] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 9,
		itemid = 112201,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横戒指[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[10] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 10,
		itemid = 101501,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横头盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[11] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 11,
		itemid = 102601,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横手镯",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[12] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 12,
		itemid = 105201,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横靴子",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[13] = {
		type = 1,
		type2 = 1,
		yeqian = "套装",
		typename = "纵横套装（50级）",
		type3 = 13,
		itemid = 105401,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10,
			},
		},
		txt = "纵横腰带",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[14] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 1,
		itemid = 100502,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "赤焰之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[15] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 2,
		itemid = 101003,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "赤焰战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[16] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 3,
		itemid = 101004,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "赤焰战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[17] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 4,
		itemid = 101902,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[18] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 5,
		itemid = 102202,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰戒指[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[19] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 6,
		itemid = 112202,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰戒指[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[20] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 7,
		itemid = 101502,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰头盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[21] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 8,
		itemid = 102602,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰手镯",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[22] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 9,
		itemid = 105202,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰靴子",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[23] = {
		type = 1,
		type2 = 2,
		yeqian = "套装",
		typename = "赤焰套装（55级）",
		type3 = 10,
		itemid = 105402,
		price = {
			[1] = {
				[1] = 4,
				[2] = 15,
			},
		},
		txt = "赤焰腰带",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 15,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[24] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 1,
		itemid = 100503,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "传说之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[25] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 2,
		itemid = 101005,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "传说战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[26] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 3,
		itemid = 101006,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "传说战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[27] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 4,
		itemid = 101903,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[28] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 5,
		itemid = 102203,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说戒指[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[29] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 6,
		itemid = 112203,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说戒指[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[30] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 7,
		itemid = 101503,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说头盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[31] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 8,
		itemid = 102603,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说手镯",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[32] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 9,
		itemid = 105203,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说靴子",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[33] = {
		type = 1,
		type2 = 3,
		yeqian = "套装",
		typename = "传说套装（60级）",
		type3 = 10,
		itemid = 105403,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20,
			},
		},
		txt = "传说腰带",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[34] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 1,
		itemid = 100504,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "雄霸之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[35] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 2,
		itemid = 101007,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "雄霸战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[36] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 3,
		itemid = 101008,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "雄霸战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[37] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 4,
		itemid = 101904,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[38] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 5,
		itemid = 102204,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[39] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 6,
		itemid = 112204,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[40] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 7,
		itemid = 101504,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[41] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 8,
		itemid = 102604,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[42] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 9,
		itemid = 105204,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[43] = {
		type = 1,
		type2 = 4,
		yeqian = "套装",
		typename = "雄霸套装（65级）",
		type3 = 10,
		itemid = 105404,
		price = {
			[1] = {
				[1] = 4,
				[2] = 25,
			},
		},
		txt = "雄霸护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 25,
			},
		},
		gouxuan = 1,
		pdfd = 10,
	},
	[44] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 1,
		itemid = 100505,
		price = {
			[1] = {
				[1] = 4,
				[2] = 60,
			},
		},
		txt = "苍穹之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 60,
			},
		},
		pdfd = 10,
	},
	[45] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 2,
		itemid = 101009,
		price = {
			[1] = {
				[1] = 4,
				[2] = 60,
			},
		},
		txt = "苍穹战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 60,
			},
		},
		pdfd = 10,
	},
	[46] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 3,
		itemid = 101010,
		price = {
			[1] = {
				[1] = 4,
				[2] = 60,
			},
		},
		txt = "苍穹战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 60,
			},
		},
		pdfd = 10,
	},
	[47] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 4,
		itemid = 101905,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[48] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 5,
		itemid = 102205,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[49] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 6,
		itemid = 112205,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[50] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 7,
		itemid = 101505,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[51] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 8,
		itemid = 102605,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[52] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 9,
		itemid = 105205,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[53] = {
		type = 1,
		type2 = 5,
		yeqian = "套装",
		typename = "苍穹套装（70级）",
		type3 = 10,
		itemid = 105405,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[54] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 1,
		itemid = 100506,
		price = {
			[1] = {
				[1] = 4,
				[2] = 70,
			},
		},
		txt = "乾坤之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 70,
			},
		},
		pdfd = 10,
	},
	[55] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 2,
		itemid = 101011,
		price = {
			[1] = {
				[1] = 4,
				[2] = 70,
			},
		},
		txt = "乾坤战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 70,
			},
		},
		pdfd = 10,
	},
	[56] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 3,
		itemid = 101012,
		price = {
			[1] = {
				[1] = 4,
				[2] = 70,
			},
		},
		txt = "乾坤战袍（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 70,
			},
		},
		pdfd = 10,
	},
	[57] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 4,
		itemid = 101906,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[58] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 5,
		itemid = 102206,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[59] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 6,
		itemid = 112206,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[60] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 7,
		itemid = 101506,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[61] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 8,
		itemid = 102606,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[62] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 9,
		itemid = 105206,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[63] = {
		type = 1,
		type2 = 6,
		yeqian = "套装",
		typename = "乾坤套装（75级）",
		type3 = 10,
		itemid = 105406,
		price = {
			[1] = {
				[1] = 4,
				[2] = 35,
			},
		},
		txt = "乾坤护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 35,
			},
		},
		pdfd = 10,
	},
	[64] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 1,
		itemid = 100507,
		price = {
			[1] = {
				[1] = 4,
				[2] = 80,
			},
		},
		txt = "风暴の刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 80,
			},
		},
		pdfd = 10,
	},
	[65] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 2,
		itemid = 101013,
		price = {
			[1] = {
				[1] = 4,
				[2] = 80,
			},
		},
		txt = "风暴の甲",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 80,
			},
		},
		pdfd = 10,
	},
	[66] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 3,
		itemid = 101014,
		price = {
			[1] = {
				[1] = 4,
				[2] = 80,
			},
		},
		txt = "风暴の袍",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 80,
			},
		},
		pdfd = 10,
	},
	[67] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 4,
		itemid = 101907,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[68] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 5,
		itemid = 102207,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[69] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 6,
		itemid = 112207,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[70] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 7,
		itemid = 101507,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[71] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 8,
		itemid = 102607,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[72] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 9,
		itemid = 105207,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[73] = {
		type = 1,
		type2 = 7,
		yeqian = "套装",
		typename = "风暴套装（80级）",
		type3 = 10,
		itemid = 105407,
		price = {
			[1] = {
				[1] = 4,
				[2] = 40,
			},
		},
		txt = "风暴の护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 40,
			},
		},
		pdfd = 10,
	},
	[74] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 1,
		itemid = 100508,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "九曜の刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[75] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 2,
		itemid = 101015,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "九曜の甲",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[76] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 3,
		itemid = 101016,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "九曜の袍",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[77] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 4,
		itemid = 101908,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[78] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 5,
		itemid = 102208,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[79] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 6,
		itemid = 112208,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[80] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 7,
		itemid = 101508,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[81] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 8,
		itemid = 102608,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[82] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 9,
		itemid = 105208,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[83] = {
		type = 1,
		type2 = 8,
		yeqian = "套装",
		typename = "九曜套装（1转）",
		type3 = 10,
		itemid = 105408,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "九曜の护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[84] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 1,
		itemid = 100509,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "湮灭の刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[85] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 2,
		itemid = 101017,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "湮灭の甲",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[86] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 3,
		itemid = 101018,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "湮灭の袍",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[87] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 4,
		itemid = 101909,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[88] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 5,
		itemid = 102209,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[89] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 6,
		itemid = 112209,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[90] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 7,
		itemid = 101509,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[91] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 8,
		itemid = 102609,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[92] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 9,
		itemid = 105209,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[93] = {
		type = 1,
		type2 = 9,
		yeqian = "套装",
		typename = "湮灭套装（2转）",
		type3 = 10,
		itemid = 105409,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "湮灭の护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[94] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 1,
		itemid = 100510,
		price = {
			[1] = {
				[1] = 4,
				[2] = 400,
			},
		},
		txt = "混元の刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 400,
			},
		},
		pdfd = 10,
	},
	[95] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 2,
		itemid = 101019,
		price = {
			[1] = {
				[1] = 4,
				[2] = 400,
			},
		},
		txt = "混元の甲",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 400,
			},
		},
		pdfd = 10,
	},
	[96] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 3,
		itemid = 101020,
		price = {
			[1] = {
				[1] = 4,
				[2] = 400,
			},
		},
		txt = "混元の袍",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 400,
			},
		},
		pdfd = 10,
	},
	[97] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 4,
		itemid = 101910,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[98] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 5,
		itemid = 102210,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[99] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 6,
		itemid = 112210,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[100] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 7,
		itemid = 101510,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[101] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 8,
		itemid = 102610,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の战腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[102] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 9,
		itemid = 105210,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[103] = {
		type = 1,
		type2 = 10,
		yeqian = "套装",
		typename = "混元套装（3转）",
		type3 = 10,
		itemid = 105410,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "混元の护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[104] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 1,
		itemid = 100511,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "爆·审判神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[105] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 2,
		itemid = 100512,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "血·审判神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[106] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 3,
		itemid = 100513,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "攻·审判神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[107] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 4,
		itemid = 101021,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "闪·审判战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[108] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 5,
		itemid = 101022,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "闪·审判战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[109] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 6,
		itemid = 101023,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "抗·审判战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[110] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 7,
		itemid = 101024,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "抗·审判战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[111] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 8,
		itemid = 101025,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "防·审判战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[112] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 9,
		itemid = 101026,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		txt = "防·审判战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[113] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 10,
		itemid = 101911,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "破·审判项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[114] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 11,
		itemid = 101912,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "血·审判项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[115] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 12,
		itemid = 101913,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "攻·审判项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[116] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 13,
		itemid = 102211,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "攻·审判战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[117] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 14,
		itemid = 102212,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "爆·审判战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[118] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 15,
		itemid = 102213,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "狂·审判战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[119] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 16,
		itemid = 112211,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "攻·审判战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[120] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 17,
		itemid = 112212,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "爆·审判战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[121] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 18,
		itemid = 112213,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "狂·审判战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[122] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 19,
		itemid = 101511,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "防·审判战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[123] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 20,
		itemid = 101512,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "反·审判战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[124] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 21,
		itemid = 101513,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "闪·审判战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[125] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 22,
		itemid = 102611,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "爆·审判护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[126] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 23,
		itemid = 102612,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "破·审判护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[127] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 24,
		itemid = 102613,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "反·审判护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[128] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 25,
		itemid = 105211,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "防·审判战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[129] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 26,
		itemid = 105212,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "抗·审判战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[130] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 27,
		itemid = 105213,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "破·审判战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[131] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 28,
		itemid = 105411,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "抗·审判护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[132] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 29,
		itemid = 105412,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "反·审判护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[133] = {
		type = 1,
		type2 = 11,
		yeqian = "套装",
		typename = "审判套装（4转）",
		type3 = 30,
		itemid = 105413,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "闪·审判护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[134] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 1,
		itemid = 100514,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "爆·逐月神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[135] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 2,
		itemid = 100515,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "血·逐月神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[136] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 3,
		itemid = 100516,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "攻·逐月神剑",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[137] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 4,
		itemid = 101027,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "闪·逐月战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[138] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 5,
		itemid = 101028,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "闪·逐月战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[139] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 6,
		itemid = 101029,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "抗·逐月战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[140] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 7,
		itemid = 101030,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "抗·逐月战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[141] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 8,
		itemid = 101031,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "防·逐月战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[142] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 9,
		itemid = 101032,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		txt = "防·逐月战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[143] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 10,
		itemid = 101914,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "破·逐月项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[144] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 11,
		itemid = 101915,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "血·逐月项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[145] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 12,
		itemid = 101916,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "攻·逐月项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[146] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 13,
		itemid = 102214,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "攻·逐月战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[147] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 14,
		itemid = 102215,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "爆·逐月战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[148] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 15,
		itemid = 102216,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "狂·逐月战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[149] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 16,
		itemid = 112214,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "攻·逐月战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[150] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 17,
		itemid = 112215,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "爆·逐月战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[151] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 18,
		itemid = 112216,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "狂·逐月战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[152] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 19,
		itemid = 101514,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "防·逐月战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[153] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 20,
		itemid = 101515,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "反·逐月战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[154] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 21,
		itemid = 101516,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "闪·逐月战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[155] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 22,
		itemid = 102614,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "爆·逐月护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[156] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 23,
		itemid = 102615,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "破·逐月护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[157] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 24,
		itemid = 102616,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "反·逐月护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[158] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 25,
		itemid = 105214,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "防·逐月战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[159] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 26,
		itemid = 105215,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "抗·逐月战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[160] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 27,
		itemid = 105216,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "破·逐月战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[161] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 28,
		itemid = 105414,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "抗·逐月护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[162] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 29,
		itemid = 105415,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "反·逐月护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[163] = {
		type = 1,
		type2 = 12,
		yeqian = "套装",
		typename = "逐月套装（5转）",
		type3 = 30,
		itemid = 105416,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "闪·逐月护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[164] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 1,
		itemid = 100517,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "爆·太虚之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[165] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 2,
		itemid = 100518,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "血·太虚之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[166] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 3,
		itemid = 100519,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "攻·太虚之刃",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[167] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 4,
		itemid = 101033,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "闪·太虚战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[168] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 5,
		itemid = 101034,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "闪·太虚战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[169] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 6,
		itemid = 101035,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "抗·太虚战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[170] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 7,
		itemid = 101036,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "抗·太虚战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[171] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 8,
		itemid = 101037,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "防·太虚战甲（男）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[172] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 9,
		itemid = 101038,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		txt = "防·太虚战衣（女）",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
			[2] = {
				[1] = 7340306,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[173] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 10,
		itemid = 101917,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "破·太虚项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[174] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 11,
		itemid = 101918,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "血·太虚项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[175] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 12,
		itemid = 101919,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "攻·太虚项链",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[176] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 13,
		itemid = 102217,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "攻·太虚战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[177] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 14,
		itemid = 102218,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "爆·太虚战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[178] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 15,
		itemid = 102219,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "狂·太虚战戒[麻痹]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[179] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 16,
		itemid = 112217,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "攻·太虚战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[180] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 17,
		itemid = 112218,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "爆·太虚战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[181] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 18,
		itemid = 112219,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "狂·太虚战戒[复活]",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[182] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 19,
		itemid = 101517,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "防·太虚战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[183] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 20,
		itemid = 101518,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "反·太虚战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[184] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 21,
		itemid = 101519,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "闪·太虚战盔",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[185] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 22,
		itemid = 102617,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "爆·太虚护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[186] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 23,
		itemid = 102618,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "破·太虚护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[187] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 24,
		itemid = 102619,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "反·太虚护腕",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[188] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 25,
		itemid = 105217,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "防·太虚战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[189] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 26,
		itemid = 105218,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "抗·太虚战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[190] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 27,
		itemid = 105219,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "破·太虚战靴",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[191] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 28,
		itemid = 105417,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "抗·太虚护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[192] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 29,
		itemid = 105418,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "反·太虚护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[193] = {
		type = 1,
		type2 = 13,
		yeqian = "套装",
		typename = "太虚套装（6转）",
		type3 = 30,
		itemid = 105419,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		txt = "闪·太虚护腰",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 3,
			},
		},
		pdfd = 10,
	},
	[194] = {
		type = 2,
		type2 = 1,
		yeqian = "特殊",
		typename = "苍穹神饰（60级）",
		type3 = 1,
		itemid = 103001,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[195] = {
		type = 2,
		type2 = 1,
		yeqian = "特殊",
		typename = "苍穹神饰（60级）",
		type3 = 2,
		itemid = 101601,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[196] = {
		type = 2,
		type2 = 1,
		yeqian = "特殊",
		typename = "苍穹神饰（60级）",
		type3 = 3,
		itemid = 104801,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[197] = {
		type = 2,
		type2 = 1,
		yeqian = "特殊",
		typename = "苍穹神饰（60级）",
		type3 = 4,
		itemid = 100701,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[198] = {
		type = 2,
		type2 = 1,
		yeqian = "特殊",
		typename = "苍穹神饰（60级）",
		type3 = 5,
		itemid = 102501,
		price = {
			[1] = {
				[1] = 4,
				[2] = 30,
			},
		},
		txt = "苍穹血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 30,
			},
		},
		pdfd = 10,
	},
	[199] = {
		type = 2,
		type2 = 2,
		yeqian = "特殊",
		typename = "乾坤神饰（75级）",
		type3 = 1,
		itemid = 103002,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "乾坤勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[200] = {
		type = 2,
		type2 = 2,
		yeqian = "特殊",
		typename = "乾坤神饰（75级）",
		type3 = 2,
		itemid = 101602,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "乾坤斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[201] = {
		type = 2,
		type2 = 2,
		yeqian = "特殊",
		typename = "乾坤神饰（75级）",
		type3 = 3,
		itemid = 104802,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "乾坤盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[202] = {
		type = 2,
		type2 = 2,
		yeqian = "特殊",
		typename = "乾坤神饰（75级）",
		type3 = 4,
		itemid = 100702,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "乾坤宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[203] = {
		type = 2,
		type2 = 2,
		yeqian = "特殊",
		typename = "乾坤神饰（75级）",
		type3 = 5,
		itemid = 102502,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "乾坤血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[204] = {
		type = 2,
		type2 = 3,
		yeqian = "特殊",
		typename = "风暴神饰（80级）",
		type3 = 1,
		itemid = 103003,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "风暴の勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[205] = {
		type = 2,
		type2 = 3,
		yeqian = "特殊",
		typename = "风暴神饰（80级）",
		type3 = 2,
		itemid = 101603,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "风暴の斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[206] = {
		type = 2,
		type2 = 3,
		yeqian = "特殊",
		typename = "风暴神饰（80级）",
		type3 = 3,
		itemid = 104803,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "风暴の盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[207] = {
		type = 2,
		type2 = 3,
		yeqian = "特殊",
		typename = "风暴神饰（80级）",
		type3 = 4,
		itemid = 100703,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "风暴の宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[208] = {
		type = 2,
		type2 = 3,
		yeqian = "特殊",
		typename = "风暴神饰（80级）",
		type3 = 5,
		itemid = 102503,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "风暴の血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[209] = {
		type = 2,
		type2 = 4,
		yeqian = "特殊",
		typename = "九曜神饰（1转）",
		type3 = 1,
		itemid = 103004,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "九曜の勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[210] = {
		type = 2,
		type2 = 4,
		yeqian = "特殊",
		typename = "九曜神饰（1转）",
		type3 = 2,
		itemid = 101604,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "九曜の斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[211] = {
		type = 2,
		type2 = 4,
		yeqian = "特殊",
		typename = "九曜神饰（1转）",
		type3 = 3,
		itemid = 104804,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "九曜の盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[212] = {
		type = 2,
		type2 = 4,
		yeqian = "特殊",
		typename = "九曜神饰（1转）",
		type3 = 4,
		itemid = 100704,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "九曜の宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[213] = {
		type = 2,
		type2 = 4,
		yeqian = "特殊",
		typename = "九曜神饰（1转）",
		type3 = 5,
		itemid = 102504,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "九曜の血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[214] = {
		type = 2,
		type2 = 5,
		yeqian = "特殊",
		typename = "混元神饰（2转）",
		type3 = 1,
		itemid = 103005,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "混元の勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[215] = {
		type = 2,
		type2 = 5,
		yeqian = "特殊",
		typename = "混元神饰（2转）",
		type3 = 2,
		itemid = 101605,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "混元の斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[216] = {
		type = 2,
		type2 = 5,
		yeqian = "特殊",
		typename = "混元神饰（2转）",
		type3 = 3,
		itemid = 104805,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "混元の盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[217] = {
		type = 2,
		type2 = 5,
		yeqian = "特殊",
		typename = "混元神饰（2转）",
		type3 = 4,
		itemid = 100705,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "混元の宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[218] = {
		type = 2,
		type2 = 5,
		yeqian = "特殊",
		typename = "混元神饰（2转）",
		type3 = 5,
		itemid = 102505,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "混元の血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[219] = {
		type = 2,
		type2 = 6,
		yeqian = "特殊",
		typename = "审判神饰（3转）",
		type3 = 1,
		itemid = 103006,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "审判勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[220] = {
		type = 2,
		type2 = 6,
		yeqian = "特殊",
		typename = "审判神饰（3转）",
		type3 = 2,
		itemid = 101606,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "审判斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[221] = {
		type = 2,
		type2 = 6,
		yeqian = "特殊",
		typename = "审判神饰（3转）",
		type3 = 3,
		itemid = 104806,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "审判盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[222] = {
		type = 2,
		type2 = 6,
		yeqian = "特殊",
		typename = "审判神饰（3转）",
		type3 = 4,
		itemid = 100706,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "审判宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[223] = {
		type = 2,
		type2 = 6,
		yeqian = "特殊",
		typename = "审判神饰（3转）",
		type3 = 5,
		itemid = 102506,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "审判血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[224] = {
		type = 2,
		type2 = 7,
		yeqian = "特殊",
		typename = "太虚神饰（5转）",
		type3 = 1,
		itemid = 103007,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "太虚勋章",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[225] = {
		type = 2,
		type2 = 7,
		yeqian = "特殊",
		typename = "太虚神饰（5转）",
		type3 = 2,
		itemid = 101607,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "太虚斗笠",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[226] = {
		type = 2,
		type2 = 7,
		yeqian = "特殊",
		typename = "太虚神饰（5转）",
		type3 = 3,
		itemid = 104807,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "太虚盾牌",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[227] = {
		type = 2,
		type2 = 7,
		yeqian = "特殊",
		typename = "太虚神饰（5转）",
		type3 = 4,
		itemid = 100707,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "太虚宝石",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[228] = {
		type = 2,
		type2 = 7,
		yeqian = "特殊",
		typename = "太虚神饰（5转）",
		type3 = 5,
		itemid = 102507,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "太虚血玉",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[229] = {
		type = 2,
		type2 = 8,
		yeqian = "特殊",
		typename = "真·战旗（1转）",
		type3 = 1,
		itemid = 106501,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "攻杀秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[230] = {
		type = 2,
		type2 = 8,
		yeqian = "特殊",
		typename = "真·战旗（1转）",
		type3 = 2,
		itemid = 106502,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "烈火秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[231] = {
		type = 2,
		type2 = 8,
		yeqian = "特殊",
		typename = "真·战旗（1转）",
		type3 = 3,
		itemid = 106503,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "开天秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[232] = {
		type = 2,
		type2 = 9,
		yeqian = "特殊",
		typename = "真·战鼓（1转）",
		type3 = 1,
		itemid = 102801,
		price = {
			[1] = {
				[1] = 4,
				[2] = 50,
			},
		},
		txt = "刺杀秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 50,
			},
		},
		pdfd = 10,
	},
	[233] = {
		type = 2,
		type2 = 9,
		yeqian = "特殊",
		typename = "真·战鼓（1转）",
		type3 = 2,
		itemid = 102802,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "半月秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[234] = {
		type = 2,
		type2 = 9,
		yeqian = "特殊",
		typename = "真·战鼓（1转）",
		type3 = 3,
		itemid = 102803,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "逐日秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[235] = {
		type = 2,
		type2 = 10,
		yeqian = "特殊",
		typename = "神·战旗（5转）",
		type3 = 1,
		itemid = 106504,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "爆裂秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[236] = {
		type = 2,
		type2 = 10,
		yeqian = "特殊",
		typename = "神·战旗（5转）",
		type3 = 2,
		itemid = 106505,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "虎啸秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[237] = {
		type = 2,
		type2 = 10,
		yeqian = "特殊",
		typename = "神·战旗（5转）",
		type3 = 3,
		itemid = 106506,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "焚天秘术·战旗",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[238] = {
		type = 2,
		type2 = 11,
		yeqian = "特殊",
		typename = "神·战鼓（5转）",
		type3 = 1,
		itemid = 102804,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "微星秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[239] = {
		type = 2,
		type2 = 11,
		yeqian = "特殊",
		typename = "神·战鼓（5转）",
		type3 = 2,
		itemid = 102805,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		txt = "轩辕秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 1,
			},
		},
		pdfd = 10,
	},
	[240] = {
		type = 2,
		type2 = 11,
		yeqian = "特殊",
		typename = "神·战鼓（5转）",
		type3 = 3,
		itemid = 102806,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		txt = "狂怒秘术·战鼓",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
			[2] = {
				[1] = 7340305,
				[2] = 2,
			},
		},
		pdfd = 10,
	},
	[241] = {
		type = 3,
		type2 = 1,
		yeqian = "转生",
		typename = "一转证明",
		type3 = 1,
		itemid = 5204501,
		price = {
			[1] = {
				[1] = 4,
				[2] = 100,
			},
		},
		txt = "一转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 100,
			},
		},
		pdfd = 10,
	},
	[242] = {
		type = 3,
		type2 = 2,
		yeqian = "转生",
		typename = "二转证明",
		type3 = 1,
		itemid = 5204502,
		price = {
			[1] = {
				[1] = 4,
				[2] = 200,
			},
		},
		txt = "二转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 200,
			},
		},
		pdfd = 10,
	},
	[243] = {
		type = 3,
		type2 = 3,
		yeqian = "转生",
		typename = "三转证明",
		type3 = 1,
		itemid = 5204503,
		price = {
			[1] = {
				[1] = 4,
				[2] = 300,
			},
		},
		txt = "三转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 300,
			},
		},
		pdfd = 10,
	},
	[244] = {
		type = 3,
		type2 = 4,
		yeqian = "转生",
		typename = "四转证明",
		type3 = 1,
		itemid = 5204504,
		price = {
			[1] = {
				[1] = 4,
				[2] = 400,
			},
		},
		txt = "四转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 400,
			},
		},
		pdfd = 10,
	},
	[245] = {
		type = 3,
		type2 = 5,
		yeqian = "转生",
		typename = "五转证明",
		type3 = 1,
		itemid = 5204505,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "五转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[246] = {
		type = 3,
		type2 = 6,
		yeqian = "转生",
		typename = "六转证明",
		type3 = 1,
		itemid = 5204506,
		price = {
			[1] = {
				[1] = 4,
				[2] = 600,
			},
		},
		txt = "六转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 600,
			},
		},
		pdfd = 10,
	},
	[247] = {
		type = 3,
		type2 = 7,
		yeqian = "转生",
		typename = "七转证明",
		type3 = 1,
		itemid = 5204507,
		price = {
			[1] = {
				[1] = 4,
				[2] = 700,
			},
		},
		txt = "七转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 700,
			},
		},
		pdfd = 10,
	},
	[248] = {
		type = 3,
		type2 = 8,
		yeqian = "转生",
		typename = "八转证明",
		type3 = 1,
		itemid = 5204508,
		price = {
			[1] = {
				[1] = 4,
				[2] = 800,
			},
		},
		txt = "八转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 800,
			},
		},
		pdfd = 10,
	},
	[249] = {
		type = 3,
		type2 = 9,
		yeqian = "转生",
		typename = "九转证明",
		type3 = 1,
		itemid = 5204509,
		price = {
			[1] = {
				[1] = 4,
				[2] = 900,
			},
		},
		txt = "九转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 900,
			},
		},
		pdfd = 10,
	},
	[250] = {
		type = 3,
		type2 = 10,
		yeqian = "转生",
		typename = "十转证明",
		type3 = 1,
		itemid = 5204510,
		price = {
			[1] = {
				[1] = 4,
				[2] = 1000,
			},
		},
		txt = "十转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 1000,
			},
		},
		pdfd = 10,
	},
	[251] = {
		type = 3,
		type2 = 11,
		yeqian = "转生",
		typename = "十一转证明",
		type3 = 1,
		itemid = 5204511,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
		},
		txt = "十一转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
		},
		pdfd = 10,
	},
	[252] = {
		type = 3,
		type2 = 12,
		yeqian = "转生",
		typename = "十二转证明",
		type3 = 1,
		itemid = 5204512,
		price = {
			[1] = {
				[1] = 4,
				[2] = 3000,
			},
		},
		txt = "十二转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 3000,
			},
		},
		pdfd = 10,
	},
	[253] = {
		type = 3,
		type2 = 13,
		yeqian = "转生",
		typename = "十三转证明",
		type3 = 1,
		itemid = 5204513,
		price = {
			[1] = {
				[1] = 4,
				[2] = 4000,
			},
		},
		txt = "十三转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 4000,
			},
		},
		pdfd = 10,
	},
	[254] = {
		type = 3,
		type2 = 14,
		yeqian = "转生",
		typename = "十四转证明",
		type3 = 1,
		itemid = 5204514,
		price = {
			[1] = {
				[1] = 4,
				[2] = 5000,
			},
		},
		txt = "十四转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 5000,
			},
		},
		pdfd = 10,
	},
	[255] = {
		type = 3,
		type2 = 15,
		yeqian = "转生",
		typename = "十五转证明",
		type3 = 1,
		itemid = 5204515,
		price = {
			[1] = {
				[1] = 4,
				[2] = 6000,
			},
		},
		txt = "十五转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 6000,
			},
		},
		pdfd = 10,
	},
	[256] = {
		type = 3,
		type2 = 16,
		yeqian = "转生",
		typename = "十六转证明",
		type3 = 1,
		itemid = 5204516,
		price = {
			[1] = {
				[1] = 4,
				[2] = 7000,
			},
		},
		txt = "十六转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 7000,
			},
		},
		pdfd = 10,
	},
	[257] = {
		type = 3,
		type2 = 17,
		yeqian = "转生",
		typename = "十七转证明",
		type3 = 1,
		itemid = 5204517,
		price = {
			[1] = {
				[1] = 4,
				[2] = 8000,
			},
		},
		txt = "十七转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 8000,
			},
		},
		pdfd = 10,
	},
	[258] = {
		type = 3,
		type2 = 18,
		yeqian = "转生",
		typename = "十八转证明",
		type3 = 1,
		itemid = 5204518,
		price = {
			[1] = {
				[1] = 4,
				[2] = 9000,
			},
		},
		txt = "十八转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 9000,
			},
		},
		pdfd = 10,
	},
	[259] = {
		type = 3,
		type2 = 19,
		yeqian = "转生",
		typename = "十九转证明",
		type3 = 1,
		itemid = 5204519,
		price = {
			[1] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		txt = "十九转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 10000,
			},
		},
		pdfd = 10,
	},
	[260] = {
		type = 3,
		type2 = 20,
		yeqian = "转生",
		typename = "二十转证明",
		type3 = 1,
		itemid = 5204520,
		price = {
			[1] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		txt = "二十转证明",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 20000,
			},
		},
		pdfd = 10,
	},
	[261] = {
		type = 4,
		type2 = 1,
		yeqian = "材料",
		typename = "紫金之源",
		type3 = 1,
		itemid = 7340301,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "紫金之源",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[262] = {
		type = 4,
		type2 = 2,
		yeqian = "材料",
		typename = "神火之源",
		type3 = 1,
		itemid = 7340302,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "神火之源",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[263] = {
		type = 4,
		type2 = 3,
		yeqian = "材料",
		typename = "青云之源",
		type3 = 1,
		itemid = 7340303,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
		},
		txt = "青云之源",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
		},
		pdfd = 10,
	},
	[264] = {
		type = 4,
		type2 = 4,
		yeqian = "材料",
		typename = "震雷之源",
		type3 = 1,
		itemid = 7340304,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
		},
		txt = "震雷之源",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
		},
		pdfd = 10,
	},
	[265] = {
		type = 4,
		type2 = 5,
		yeqian = "材料",
		typename = "破境丹",
		type3 = 1,
		itemid = 7340305,
		price = {
			[1] = {
				[1] = 4,
				[2] = 500,
			},
		},
		txt = "破境丹",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 500,
			},
		},
		pdfd = 10,
	},
	[266] = {
		type = 4,
		type2 = 6,
		yeqian = "材料",
		typename = "极品破境丹",
		type3 = 1,
		itemid = 7340306,
		price = {
			[1] = {
				[1] = 4,
				[2] = 2000,
			},
		},
		txt = "极品破境丹",
		price1 = {
			[1] = {
				[1] = 2,
				[2] = 2000,
			},
		},
		pdfd = 10,
	},
}
return config