local config = {
	[1] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000101,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		product = {
			[1] = {
				[1] = 8000102,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[2] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000102,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000103,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[3] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000103,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		product = {
			[1] = {
				[1] = 8000104,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[4] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		product = {
			[1] = {
				[1] = 8000105,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[5] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000105,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		product = {
			[1] = {
				[1] = 8000106,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[6] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000106,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		product = {
			[1] = {
				[1] = 8000107,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[7] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000107,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		product = {
			[1] = {
				[1] = 8000108,
				[2] = 1,
			},
		},
		name2 = "红宝石",
		probability = 10000,
		npcid = 249,
	},
	[8] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000201,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		product = {
			[1] = {
				[1] = 8000202,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[9] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000202,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000203,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[10] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000203,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		product = {
			[1] = {
				[1] = 8000204,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[11] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000204,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		product = {
			[1] = {
				[1] = 8000205,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[12] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000205,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		product = {
			[1] = {
				[1] = 8000206,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[13] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000206,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		product = {
			[1] = {
				[1] = 8000207,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[14] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000207,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		product = {
			[1] = {
				[1] = 8000208,
				[2] = 1,
			},
		},
		name2 = "黄宝石",
		probability = 10000,
		npcid = 249,
	},
	[15] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000301,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000,
			},
		},
		product = {
			[1] = {
				[1] = 8000302,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[16] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000302,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000303,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[17] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000303,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 50000,
			},
		},
		product = {
			[1] = {
				[1] = 8000304,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[18] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000304,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 100000,
			},
		},
		product = {
			[1] = {
				[1] = 8000305,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[19] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000305,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 200000,
			},
		},
		product = {
			[1] = {
				[1] = 8000306,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[20] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000306,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 400000,
			},
		},
		product = {
			[1] = {
				[1] = 8000307,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[21] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000307,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 800000,
			},
		},
		product = {
			[1] = {
				[1] = 8000308,
				[2] = 1,
			},
		},
		name2 = "绿宝石",
		probability = 10000,
		npcid = 249,
	},
	[22] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000401,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000402,
				[2] = 1,
			},
		},
		name2 = "珊瑚石",
		probability = 10000,
		npcid = 249,
	},
	[23] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000402,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		product = {
			[1] = {
				[1] = 8000403,
				[2] = 1,
			},
		},
		name2 = "珊瑚石",
		probability = 10000,
		npcid = 249,
	},
	[24] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000403,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		product = {
			[1] = {
				[1] = 8000404,
				[2] = 1,
			},
		},
		name2 = "珊瑚石",
		probability = 10000,
		npcid = 249,
	},
	[25] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000404,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		product = {
			[1] = {
				[1] = 8000405,
				[2] = 1,
			},
		},
		name2 = "珊瑚石",
		probability = 10000,
		npcid = 249,
	},
	[26] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000501,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000502,
				[2] = 1,
			},
		},
		name2 = "琉璃石",
		probability = 10000,
		npcid = 249,
	},
	[27] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000502,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		product = {
			[1] = {
				[1] = 8000503,
				[2] = 1,
			},
		},
		name2 = "琉璃石",
		probability = 10000,
		npcid = 249,
	},
	[28] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000503,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		product = {
			[1] = {
				[1] = 8000504,
				[2] = 1,
			},
		},
		name2 = "琉璃石",
		probability = 10000,
		npcid = 249,
	},
	[29] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000504,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		product = {
			[1] = {
				[1] = 8000505,
				[2] = 1,
			},
		},
		name2 = "琉璃石",
		probability = 10000,
		npcid = 249,
	},
	[30] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000601,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000602,
				[2] = 1,
			},
		},
		name2 = "琥珀石",
		probability = 10000,
		npcid = 249,
	},
	[31] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000602,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		product = {
			[1] = {
				[1] = 8000603,
				[2] = 1,
			},
		},
		name2 = "琥珀石",
		probability = 10000,
		npcid = 249,
	},
	[32] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000603,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		product = {
			[1] = {
				[1] = 8000604,
				[2] = 1,
			},
		},
		name2 = "琥珀石",
		probability = 10000,
		npcid = 249,
	},
	[33] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000604,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		product = {
			[1] = {
				[1] = 8000605,
				[2] = 1,
			},
		},
		name2 = "琥珀石",
		probability = 10000,
		npcid = 249,
	},
	[34] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000701,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000702,
				[2] = 1,
			},
		},
		name2 = "玛瑙石",
		probability = 10000,
		npcid = 249,
	},
	[35] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000702,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		product = {
			[1] = {
				[1] = 8000703,
				[2] = 1,
			},
		},
		name2 = "玛瑙石",
		probability = 10000,
		npcid = 249,
	},
	[36] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000703,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		product = {
			[1] = {
				[1] = 8000704,
				[2] = 1,
			},
		},
		name2 = "玛瑙石",
		probability = 10000,
		npcid = 249,
	},
	[37] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000704,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		product = {
			[1] = {
				[1] = 8000705,
				[2] = 1,
			},
		},
		name2 = "玛瑙石",
		probability = 10000,
		npcid = 249,
	},
	[38] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000801,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 20000,
			},
		},
		product = {
			[1] = {
				[1] = 8000802,
				[2] = 1,
			},
		},
		name2 = "红玉髓",
		probability = 10000,
		npcid = 249,
	},
	[39] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000802,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 40000,
			},
		},
		product = {
			[1] = {
				[1] = 8000803,
				[2] = 1,
			},
		},
		name2 = "红玉髓",
		probability = 10000,
		npcid = 249,
	},
	[40] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000803,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 80000,
			},
		},
		product = {
			[1] = {
				[1] = 8000804,
				[2] = 1,
			},
		},
		name2 = "红玉髓",
		probability = 10000,
		npcid = 249,
	},
	[41] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 8000804,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1600000,
			},
		},
		product = {
			[1] = {
				[1] = 8000805,
				[2] = 1,
			},
		},
		name2 = "红玉髓",
		probability = 10000,
		npcid = 249,
	},
	[42] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 500000,
			},
		},
		product = {
			[1] = {
				[1] = 502001,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 5000,
	},
	[43] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 1000000,
			},
		},
		product = {
			[1] = {
				[1] = 502002,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 4000,
	},
	[44] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 2000000,
			},
		},
		product = {
			[1] = {
				[1] = 502003,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 3500,
	},
	[45] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 502004,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 3000,
	},
	[46] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 8,
			},
			[2] = {
				[1] = 9000913,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 502005,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 2500,
	},
	[47] = {
		type = 1,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 19,
		itemid1 = {
			[1] = {
				[1] = 9000901,
				[2] = 10,
			},
			[2] = {
				[1] = 9000913,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 502006,
				[2] = 1,
			},
		},
		name = "亡灵蛛妖",
		name2 = "上古图腾",
		probability = 2000,
	},
	[48] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 500000,
			},
		},
		product = {
			[1] = {
				[1] = 503001,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[49] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 1000000,
			},
		},
		product = {
			[1] = {
				[1] = 503002,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 4000,
	},
	[50] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 2000000,
			},
		},
		product = {
			[1] = {
				[1] = 503003,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 3500,
	},
	[51] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 503004,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 3000,
	},
	[52] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 8,
			},
			[2] = {
				[1] = 9000913,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 503005,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 2500,
	},
	[53] = {
		type = 1,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 20,
		itemid1 = {
			[1] = {
				[1] = 9000902,
				[2] = 10,
			},
			[2] = {
				[1] = 9000913,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 503006,
				[2] = 1,
			},
		},
		name = "嗜血守护神",
		name2 = "上古图腾",
		probability = 2000,
	},
	[54] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 500000,
			},
		},
		product = {
			[1] = {
				[1] = 504001,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 5000,
	},
	[55] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 1000000,
			},
		},
		product = {
			[1] = {
				[1] = 504002,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 4000,
	},
	[56] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 2000000,
			},
		},
		product = {
			[1] = {
				[1] = 504003,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 3500,
	},
	[57] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 504004,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 3000,
	},
	[58] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 8,
			},
			[2] = {
				[1] = 9000913,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 504005,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 2500,
	},
	[59] = {
		type = 1,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 21,
		itemid1 = {
			[1] = {
				[1] = 9000903,
				[2] = 10,
			},
			[2] = {
				[1] = 9000913,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 504006,
				[2] = 1,
			},
		},
		name = "路西菲尔斯",
		name2 = "上古图腾",
		probability = 2000,
	},
	[60] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 500000,
			},
		},
		product = {
			[1] = {
				[1] = 505001,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 5000,
	},
	[61] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 1000000,
			},
		},
		product = {
			[1] = {
				[1] = 505002,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 4000,
	},
	[62] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 2000000,
			},
		},
		product = {
			[1] = {
				[1] = 505003,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 3500,
	},
	[63] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 505004,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 3000,
	},
	[64] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 8,
			},
			[2] = {
				[1] = 9000913,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 505005,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 2500,
	},
	[65] = {
		type = 1,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 22,
		itemid1 = {
			[1] = {
				[1] = 9000904,
				[2] = 10,
			},
			[2] = {
				[1] = 9000913,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 505006,
				[2] = 1,
			},
		},
		name = "精灵王",
		name2 = "上古图腾",
		probability = 2000,
	},
	[66] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 1500000,
			},
		},
		product = {
			[1] = {
				[1] = 506001,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[67] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 506002,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[68] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 4500000,
			},
		},
		product = {
			[1] = {
				[1] = 506003,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[69] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 506004,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[70] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 5,
			},
			[2] = {
				[1] = 9000913,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 7500000,
			},
		},
		product = {
			[1] = {
				[1] = 506005,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[71] = {
		type = 1,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 23,
		itemid1 = {
			[1] = {
				[1] = 9000905,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 506006,
				[2] = 1,
			},
		},
		name = "死神收割者",
		name2 = "上古图腾",
		probability = 5000,
	},
	[72] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 1500000,
			},
		},
		product = {
			[1] = {
				[1] = 507001,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[73] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 507002,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[74] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 4500000,
			},
		},
		product = {
			[1] = {
				[1] = 507003,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[75] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 507004,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[76] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 5,
			},
			[2] = {
				[1] = 9000913,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 7500000,
			},
		},
		product = {
			[1] = {
				[1] = 507005,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[77] = {
		type = 1,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 24,
		itemid1 = {
			[1] = {
				[1] = 9000906,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 507006,
				[2] = 1,
			},
		},
		name = "热血战士",
		name2 = "上古图腾",
		probability = 5000,
	},
	[78] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 1500000,
			},
		},
		product = {
			[1] = {
				[1] = 508001,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[79] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 508002,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[80] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 4500000,
			},
		},
		product = {
			[1] = {
				[1] = 508003,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[81] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 508004,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[82] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 5,
			},
			[2] = {
				[1] = 9000913,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 7500000,
			},
		},
		product = {
			[1] = {
				[1] = 508005,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[83] = {
		type = 1,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 25,
		itemid1 = {
			[1] = {
				[1] = 9000907,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 508006,
				[2] = 1,
			},
		},
		name = "幽影之战神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[84] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 1500000,
			},
		},
		product = {
			[1] = {
				[1] = 509001,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[85] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 509002,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[86] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 4500000,
			},
		},
		product = {
			[1] = {
				[1] = 509003,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[87] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 4,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 509004,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[88] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 5,
			},
			[2] = {
				[1] = 9000913,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 7500000,
			},
		},
		product = {
			[1] = {
				[1] = 509005,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[89] = {
		type = 1,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 26,
		itemid1 = {
			[1] = {
				[1] = 9000908,
				[2] = 6,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 509006,
				[2] = 1,
			},
		},
		name = "格里芬的诱惑",
		name2 = "上古图腾",
		probability = 5000,
	},
	[90] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 1,
		condition2 = 10050,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 510001,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 9000,
	},
	[91] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 2,
		condition2 = 10055,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 510002,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 8000,
	},
	[92] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 3,
		condition2 = 10060,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 510003,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 7000,
	},
	[93] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 4,
		condition2 = 10065,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 510004,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 6000,
	},
	[94] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 5,
		condition2 = 10070,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 15000000,
			},
		},
		product = {
			[1] = {
				[1] = 510005,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 5000,
	},
	[95] = {
		type = 1,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 6,
		condition2 = 10075,
		type2 = 27,
		itemid1 = {
			[1] = {
				[1] = 9000909,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 36,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 510006,
				[2] = 1,
			},
		},
		name = "戴维德的祈祷",
		name2 = "上古图腾",
		probability = 5000,
	},
	[96] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 1,
		condition2 = 10060,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 511001,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 9000,
	},
	[97] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 2,
		condition2 = 10075,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 511002,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 8000,
	},
	[98] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 3,
		condition2 = 10080,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 511003,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 7000,
	},
	[99] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 4,
		condition2 = 30001,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 511004,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 6000,
	},
	[100] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 5,
		condition2 = 30002,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 15000000,
			},
		},
		product = {
			[1] = {
				[1] = 511005,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 5000,
	},
	[101] = {
		type = 1,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 6,
		condition2 = 30003,
		type2 = 28,
		itemid1 = {
			[1] = {
				[1] = 9000910,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 36,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 511006,
				[2] = 1,
			},
		},
		name = "契约法师",
		name2 = "上古图腾",
		probability = 5000,
	},
	[102] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 1,
		condition2 = 10060,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 512001,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 9000,
	},
	[103] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 2,
		condition2 = 10075,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 512002,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 8000,
	},
	[104] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 3,
		condition2 = 10080,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 512003,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 7000,
	},
	[105] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 4,
		condition2 = 30001,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 512004,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 6000,
	},
	[106] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 5,
		condition2 = 30002,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 15000000,
			},
		},
		product = {
			[1] = {
				[1] = 512005,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[107] = {
		type = 1,
		page1 = 1,
		page2 = 11,
		condition = 10001,
		page3 = 6,
		condition2 = 30003,
		type2 = 29,
		itemid1 = {
			[1] = {
				[1] = 9000911,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 36,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 512006,
				[2] = 1,
			},
		},
		name = "古帝死神",
		name2 = "上古图腾",
		probability = 5000,
	},
	[108] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 1,
		condition2 = 10060,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 1,
			},
			[2] = {
				[1] = 9000913,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 513001,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 9000,
	},
	[109] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 2,
		condition2 = 10075,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 513002,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 8000,
	},
	[110] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 3,
		condition2 = 10080,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 9000000,
			},
		},
		product = {
			[1] = {
				[1] = 513003,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 7000,
	},
	[111] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 4,
		condition2 = 30001,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 513004,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 6000,
	},
	[112] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 5,
		condition2 = 30002,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 2,
			},
			[2] = {
				[1] = 9000913,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 15000000,
			},
		},
		product = {
			[1] = {
				[1] = 513005,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 5000,
	},
	[113] = {
		type = 1,
		page1 = 1,
		page2 = 12,
		condition = 10001,
		page3 = 6,
		condition2 = 30003,
		type2 = 42,
		itemid1 = {
			[1] = {
				[1] = 9000912,
				[2] = 3,
			},
			[2] = {
				[1] = 9000913,
				[2] = 36,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 513006,
				[2] = 1,
			},
		},
		name = "洪荒女战",
		name2 = "上古图腾",
		probability = 5000,
	},
	[114] = {
		type = 1,
		page1 = 2,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		product = {
			[1] = {
				[1] = 201001,
				[2] = 1,
			},
		},
		name = "鼠",
		name2 = "生肖",
		probability = 10000,
	},
	[115] = {
		type = 1,
		page1 = 2,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201001,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201002,
				[2] = 1,
			},
		},
		name = "鼠",
		name2 = "生肖",
		probability = 10000,
	},
	[116] = {
		type = 1,
		page1 = 2,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201002,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201003,
				[2] = 1,
			},
		},
		name = "鼠",
		name2 = "生肖",
		probability = 10000,
	},
	[117] = {
		type = 1,
		page1 = 2,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201003,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201004,
				[2] = 1,
			},
		},
		name = "鼠",
		name2 = "生肖",
		probability = 10000,
	},
	[118] = {
		type = 1,
		page1 = 2,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201004,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201005,
				[2] = 1,
			},
		},
		name = "鼠",
		name2 = "生肖",
		probability = 10000,
	},
	[119] = {
		type = 1,
		page1 = 2,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		product = {
			[1] = {
				[1] = 201011,
				[2] = 1,
			},
		},
		name = "牛",
		name2 = "生肖",
		probability = 10000,
	},
	[120] = {
		type = 1,
		page1 = 2,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201011,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201012,
				[2] = 1,
			},
		},
		name = "牛",
		name2 = "生肖",
		probability = 10000,
	},
	[121] = {
		type = 1,
		page1 = 2,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201012,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201013,
				[2] = 1,
			},
		},
		name = "牛",
		name2 = "生肖",
		probability = 10000,
	},
	[122] = {
		type = 1,
		page1 = 2,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201013,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201014,
				[2] = 1,
			},
		},
		name = "牛",
		name2 = "生肖",
		probability = 10000,
	},
	[123] = {
		type = 1,
		page1 = 2,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201014,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201015,
				[2] = 1,
			},
		},
		name = "牛",
		name2 = "生肖",
		probability = 10000,
	},
	[124] = {
		type = 1,
		page1 = 2,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		product = {
			[1] = {
				[1] = 201021,
				[2] = 1,
			},
		},
		name = "虎",
		name2 = "生肖",
		probability = 10000,
	},
	[125] = {
		type = 1,
		page1 = 2,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201021,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201022,
				[2] = 1,
			},
		},
		name = "虎",
		name2 = "生肖",
		probability = 10000,
	},
	[126] = {
		type = 1,
		page1 = 2,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201022,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201023,
				[2] = 1,
			},
		},
		name = "虎",
		name2 = "生肖",
		probability = 10000,
	},
	[127] = {
		type = 1,
		page1 = 2,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201023,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201024,
				[2] = 1,
			},
		},
		name = "虎",
		name2 = "生肖",
		probability = 10000,
	},
	[128] = {
		type = 1,
		page1 = 2,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201024,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201025,
				[2] = 1,
			},
		},
		name = "虎",
		name2 = "生肖",
		probability = 10000,
	},
	[129] = {
		type = 1,
		page1 = 2,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 50,
			},
			[2] = {
				[1] = 4,
				[2] = 150000,
			},
		},
		product = {
			[1] = {
				[1] = 201031,
				[2] = 1,
			},
		},
		name = "兔",
		name2 = "生肖",
		probability = 10000,
	},
	[130] = {
		type = 1,
		page1 = 2,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201031,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201032,
				[2] = 1,
			},
		},
		name = "兔",
		name2 = "生肖",
		probability = 10000,
	},
	[131] = {
		type = 1,
		page1 = 2,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201032,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201033,
				[2] = 1,
			},
		},
		name = "兔",
		name2 = "生肖",
		probability = 10000,
	},
	[132] = {
		type = 1,
		page1 = 2,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201033,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201034,
				[2] = 1,
			},
		},
		name = "兔",
		name2 = "生肖",
		probability = 10000,
	},
	[133] = {
		type = 1,
		page1 = 2,
		page2 = 4,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201034,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201035,
				[2] = 1,
			},
		},
		name = "兔",
		name2 = "生肖",
		probability = 10000,
	},
	[134] = {
		type = 1,
		page1 = 2,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201041,
				[2] = 1,
			},
		},
		name = "龙",
		name2 = "生肖",
		probability = 10000,
	},
	[135] = {
		type = 1,
		page1 = 2,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 20104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201042,
				[2] = 1,
			},
		},
		name = "龙",
		name2 = "生肖",
		probability = 10000,
	},
	[136] = {
		type = 1,
		page1 = 2,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201042,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201043,
				[2] = 1,
			},
		},
		name = "龙",
		name2 = "生肖",
		probability = 10000,
	},
	[137] = {
		type = 1,
		page1 = 2,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201043,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201044,
				[2] = 1,
			},
		},
		name = "龙",
		name2 = "生肖",
		probability = 10000,
	},
	[138] = {
		type = 1,
		page1 = 2,
		page2 = 5,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201044,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201045,
				[2] = 1,
			},
		},
		name = "龙",
		name2 = "生肖",
		probability = 10000,
	},
	[139] = {
		type = 1,
		page1 = 2,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201051,
				[2] = 1,
			},
		},
		name = "蛇",
		name2 = "生肖",
		probability = 10000,
	},
	[140] = {
		type = 1,
		page1 = 2,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201051,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201052,
				[2] = 1,
			},
		},
		name = "蛇",
		name2 = "生肖",
		probability = 10000,
	},
	[141] = {
		type = 1,
		page1 = 2,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201052,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201053,
				[2] = 1,
			},
		},
		name = "蛇",
		name2 = "生肖",
		probability = 10000,
	},
	[142] = {
		type = 1,
		page1 = 2,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201053,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201054,
				[2] = 1,
			},
		},
		name = "蛇",
		name2 = "生肖",
		probability = 10000,
	},
	[143] = {
		type = 1,
		page1 = 2,
		page2 = 6,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201054,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201055,
				[2] = 1,
			},
		},
		name = "蛇",
		name2 = "生肖",
		probability = 10000,
	},
	[144] = {
		type = 1,
		page1 = 2,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201061,
				[2] = 1,
			},
		},
		name = "马",
		name2 = "生肖",
		probability = 10000,
	},
	[145] = {
		type = 1,
		page1 = 2,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201061,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201062,
				[2] = 1,
			},
		},
		name = "马",
		name2 = "生肖",
		probability = 10000,
	},
	[146] = {
		type = 1,
		page1 = 2,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201062,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201063,
				[2] = 1,
			},
		},
		name = "马",
		name2 = "生肖",
		probability = 10000,
	},
	[147] = {
		type = 1,
		page1 = 2,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201063,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201064,
				[2] = 1,
			},
		},
		name = "马",
		name2 = "生肖",
		probability = 10000,
	},
	[148] = {
		type = 1,
		page1 = 2,
		page2 = 7,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201064,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201065,
				[2] = 1,
			},
		},
		name = "马",
		name2 = "生肖",
		probability = 10000,
	},
	[149] = {
		type = 1,
		page1 = 2,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 150,
			},
			[2] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 201071,
				[2] = 1,
			},
		},
		name = "羊",
		name2 = "生肖",
		probability = 10000,
	},
	[150] = {
		type = 1,
		page1 = 2,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201071,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201072,
				[2] = 1,
			},
		},
		name = "羊",
		name2 = "生肖",
		probability = 10000,
	},
	[151] = {
		type = 1,
		page1 = 2,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201072,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201073,
				[2] = 1,
			},
		},
		name = "羊",
		name2 = "生肖",
		probability = 10000,
	},
	[152] = {
		type = 1,
		page1 = 2,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201073,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201074,
				[2] = 1,
			},
		},
		name = "羊",
		name2 = "生肖",
		probability = 10000,
	},
	[153] = {
		type = 1,
		page1 = 2,
		page2 = 8,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201074,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201075,
				[2] = 1,
			},
		},
		name = "羊",
		name2 = "生肖",
		probability = 10000,
	},
	[154] = {
		type = 1,
		page1 = 2,
		page2 = 9,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201081,
				[2] = 1,
			},
		},
		name = "猴",
		name2 = "生肖",
		probability = 10000,
	},
	[155] = {
		type = 1,
		page1 = 2,
		page2 = 9,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201081,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201082,
				[2] = 1,
			},
		},
		name = "猴",
		name2 = "生肖",
		probability = 10000,
	},
	[156] = {
		type = 1,
		page1 = 2,
		page2 = 9,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201082,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201083,
				[2] = 1,
			},
		},
		name = "猴",
		name2 = "生肖",
		probability = 10000,
	},
	[157] = {
		type = 1,
		page1 = 2,
		page2 = 9,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201083,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201084,
				[2] = 1,
			},
		},
		name = "猴",
		name2 = "生肖",
		probability = 10000,
	},
	[158] = {
		type = 1,
		page1 = 2,
		page2 = 9,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201084,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 201085,
				[2] = 1,
			},
		},
		name = "猴",
		name2 = "生肖",
		probability = 10000,
	},
	[159] = {
		type = 1,
		page1 = 2,
		page2 = 10,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201091,
				[2] = 1,
			},
		},
		name = "鸡",
		name2 = "生肖",
		probability = 10000,
	},
	[160] = {
		type = 1,
		page1 = 2,
		page2 = 10,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201091,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201092,
				[2] = 1,
			},
		},
		name = "鸡",
		name2 = "生肖",
		probability = 10000,
	},
	[161] = {
		type = 1,
		page1 = 2,
		page2 = 10,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201092,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201093,
				[2] = 1,
			},
		},
		name = "鸡",
		name2 = "生肖",
		probability = 10000,
	},
	[162] = {
		type = 1,
		page1 = 2,
		page2 = 10,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201093,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201094,
				[2] = 1,
			},
		},
		name = "鸡",
		name2 = "生肖",
		probability = 10000,
	},
	[163] = {
		type = 1,
		page1 = 2,
		page2 = 10,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201094,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 201095,
				[2] = 1,
			},
		},
		name = "鸡",
		name2 = "生肖",
		probability = 10000,
	},
	[164] = {
		type = 1,
		page1 = 2,
		page2 = 11,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201101,
				[2] = 1,
			},
		},
		name = "狗",
		name2 = "生肖",
		probability = 10000,
	},
	[165] = {
		type = 1,
		page1 = 2,
		page2 = 11,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201101,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201102,
				[2] = 1,
			},
		},
		name = "狗",
		name2 = "生肖",
		probability = 10000,
	},
	[166] = {
		type = 1,
		page1 = 2,
		page2 = 11,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201102,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201103,
				[2] = 1,
			},
		},
		name = "狗",
		name2 = "生肖",
		probability = 10000,
	},
	[167] = {
		type = 1,
		page1 = 2,
		page2 = 11,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201103,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201104,
				[2] = 1,
			},
		},
		name = "狗",
		name2 = "生肖",
		probability = 10000,
	},
	[168] = {
		type = 1,
		page1 = 2,
		page2 = 11,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201104,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 201105,
				[2] = 1,
			},
		},
		name = "狗",
		name2 = "生肖",
		probability = 10000,
	},
	[169] = {
		type = 1,
		page1 = 2,
		page2 = 12,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 7340307,
				[2] = 300,
			},
			[2] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 201111,
				[2] = 1,
			},
		},
		name = "猪",
		name2 = "生肖",
		probability = 10000,
	},
	[170] = {
		type = 1,
		page1 = 2,
		page2 = 12,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201111,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 201112,
				[2] = 1,
			},
		},
		name = "猪",
		name2 = "生肖",
		probability = 10000,
	},
	[171] = {
		type = 1,
		page1 = 2,
		page2 = 12,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201112,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 201113,
				[2] = 1,
			},
		},
		name = "猪",
		name2 = "生肖",
		probability = 10000,
	},
	[172] = {
		type = 1,
		page1 = 2,
		page2 = 12,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201113,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 201114,
				[2] = 1,
			},
		},
		name = "猪",
		name2 = "生肖",
		probability = 10000,
	},
	[173] = {
		type = 1,
		page1 = 2,
		page2 = 12,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 201114,
				[2] = 2,
			},
			[2] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 201115,
				[2] = 1,
			},
		},
		name = "猪",
		name2 = "生肖",
		probability = 10000,
	},
	[174] = {
		type = 1,
		page1 = 3,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 103008,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 103009,
				[2] = 1,
			},
		},
		name = "勋章",
		name2 = "神饰",
		probability = 10000,
	},
	[175] = {
		type = 1,
		page1 = 3,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 103009,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 103010,
				[2] = 1,
			},
		},
		name = "勋章",
		name2 = "神饰",
		probability = 10000,
	},
	[176] = {
		type = 1,
		page1 = 3,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 103010,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 103011,
				[2] = 1,
			},
		},
		name = "勋章",
		name2 = "神饰",
		probability = 10000,
	},
	[177] = {
		type = 1,
		page1 = 3,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 103011,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 103012,
				[2] = 1,
			},
		},
		name = "勋章",
		name2 = "神饰",
		probability = 10000,
	},
	[178] = {
		type = 1,
		page1 = 3,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101608,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 101609,
				[2] = 1,
			},
		},
		name = "斗笠",
		name2 = "神饰",
		probability = 10000,
	},
	[179] = {
		type = 1,
		page1 = 3,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101609,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 101610,
				[2] = 1,
			},
		},
		name = "斗笠",
		name2 = "神饰",
		probability = 10000,
	},
	[180] = {
		type = 1,
		page1 = 3,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101610,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 101611,
				[2] = 1,
			},
		},
		name = "斗笠",
		name2 = "神饰",
		probability = 10000,
	},
	[181] = {
		type = 1,
		page1 = 3,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101611,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101612,
				[2] = 1,
			},
		},
		name = "斗笠",
		name2 = "神饰",
		probability = 10000,
	},
	[182] = {
		type = 1,
		page1 = 3,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 104808,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 104809,
				[2] = 1,
			},
		},
		name = "盾牌",
		name2 = "神饰",
		probability = 10000,
	},
	[183] = {
		type = 1,
		page1 = 3,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 104809,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 104810,
				[2] = 1,
			},
		},
		name = "盾牌",
		name2 = "神饰",
		probability = 10000,
	},
	[184] = {
		type = 1,
		page1 = 3,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 104810,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 104811,
				[2] = 1,
			},
		},
		name = "盾牌",
		name2 = "神饰",
		probability = 10000,
	},
	[185] = {
		type = 1,
		page1 = 3,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 104811,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 104812,
				[2] = 1,
			},
		},
		name = "盾牌",
		name2 = "神饰",
		probability = 10000,
	},
	[186] = {
		type = 1,
		page1 = 3,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100708,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 100709,
				[2] = 1,
			},
		},
		name = "宝石",
		name2 = "神饰",
		probability = 10000,
	},
	[187] = {
		type = 1,
		page1 = 3,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100709,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 100710,
				[2] = 1,
			},
		},
		name = "宝石",
		name2 = "神饰",
		probability = 10000,
	},
	[188] = {
		type = 1,
		page1 = 3,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100710,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 100711,
				[2] = 1,
			},
		},
		name = "宝石",
		name2 = "神饰",
		probability = 10000,
	},
	[189] = {
		type = 1,
		page1 = 3,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100711,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 100712,
				[2] = 1,
			},
		},
		name = "宝石",
		name2 = "神饰",
		probability = 10000,
	},
	[190] = {
		type = 1,
		page1 = 3,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102508,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 102509,
				[2] = 1,
			},
		},
		name = "血玉",
		name2 = "神饰",
		probability = 10000,
	},
	[191] = {
		type = 1,
		page1 = 3,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102509,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 102510,
				[2] = 1,
			},
		},
		name = "血玉",
		name2 = "神饰",
		probability = 10000,
	},
	[192] = {
		type = 1,
		page1 = 3,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102510,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 102511,
				[2] = 1,
			},
		},
		name = "血玉",
		name2 = "神饰",
		probability = 10000,
	},
	[193] = {
		type = 1,
		page1 = 3,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102511,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 102512,
				[2] = 1,
			},
		},
		name = "血玉",
		name2 = "神饰",
		probability = 10000,
	},
	[194] = {
		type = 1,
		page1 = 3,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 106507,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 106508,
				[2] = 1,
			},
		},
		name = "战旗",
		name2 = "神饰",
		probability = 10000,
	},
	[195] = {
		type = 1,
		page1 = 3,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 106508,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 106509,
				[2] = 1,
			},
		},
		name = "战旗",
		name2 = "神饰",
		probability = 10000,
	},
	[196] = {
		type = 1,
		page1 = 3,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 106509,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 106510,
				[2] = 1,
			},
		},
		name = "战旗",
		name2 = "神饰",
		probability = 10000,
	},
	[197] = {
		type = 1,
		page1 = 3,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 106510,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 106511,
				[2] = 1,
			},
		},
		name = "战旗",
		name2 = "神饰",
		probability = 10000,
	},
	[198] = {
		type = 1,
		page1 = 3,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102807,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 102808,
				[2] = 1,
			},
		},
		name = "战鼓",
		name2 = "神饰",
		probability = 10000,
	},
	[199] = {
		type = 1,
		page1 = 3,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102808,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 102809,
				[2] = 1,
			},
		},
		name = "战鼓",
		name2 = "神饰",
		probability = 10000,
	},
	[200] = {
		type = 1,
		page1 = 3,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102809,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 102810,
				[2] = 1,
			},
		},
		name = "战鼓",
		name2 = "神饰",
		probability = 10000,
	},
	[201] = {
		type = 1,
		page1 = 3,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102810,
				[2] = 3,
			},
			[2] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 102811,
				[2] = 1,
			},
		},
		name = "战鼓",
		name2 = "神饰",
		probability = 10000,
	},
	[202] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100520,
				[2] = 1,
			},
			[2] = {
				[1] = 100520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100527,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[203] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100521,
				[2] = 1,
			},
			[2] = {
				[1] = 100521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100528,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[204] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100522,
				[2] = 1,
			},
			[2] = {
				[1] = 100522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100529,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[205] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100523,
				[2] = 1,
			},
			[2] = {
				[1] = 100523,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100530,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[206] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100524,
				[2] = 1,
			},
			[2] = {
				[1] = 100524,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100531,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[207] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100525,
				[2] = 1,
			},
			[2] = {
				[1] = 100525,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100532,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[208] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100526,
				[2] = 1,
			},
			[2] = {
				[1] = 100526,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100533,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[209] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100527,
				[2] = 1,
			},
			[2] = {
				[1] = 100527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100534,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[210] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100528,
				[2] = 1,
			},
			[2] = {
				[1] = 100528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100535,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[211] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100529,
				[2] = 1,
			},
			[2] = {
				[1] = 100529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100536,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[212] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100530,
				[2] = 1,
			},
			[2] = {
				[1] = 100530,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100537,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[213] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100531,
				[2] = 1,
			},
			[2] = {
				[1] = 100531,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100538,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[214] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100532,
				[2] = 1,
			},
			[2] = {
				[1] = 100532,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100539,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[215] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100533,
				[2] = 1,
			},
			[2] = {
				[1] = 100533,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100540,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[216] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100534,
				[2] = 1,
			},
			[2] = {
				[1] = 100534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100541,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[217] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100535,
				[2] = 1,
			},
			[2] = {
				[1] = 100535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100542,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[218] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100536,
				[2] = 1,
			},
			[2] = {
				[1] = 100536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100543,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[219] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100537,
				[2] = 1,
			},
			[2] = {
				[1] = 100537,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100544,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[220] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100538,
				[2] = 1,
			},
			[2] = {
				[1] = 100538,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100545,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[221] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100539,
				[2] = 1,
			},
			[2] = {
				[1] = 100539,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100546,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[222] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100540,
				[2] = 1,
			},
			[2] = {
				[1] = 100540,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 100547,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[223] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101039,
				[2] = 1,
			},
			[2] = {
				[1] = 101039,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101053,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[224] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101041,
				[2] = 1,
			},
			[2] = {
				[1] = 101041,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101055,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[225] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101043,
				[2] = 1,
			},
			[2] = {
				[1] = 101043,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101057,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[226] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101045,
				[2] = 1,
			},
			[2] = {
				[1] = 101045,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101059,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[227] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101047,
				[2] = 1,
			},
			[2] = {
				[1] = 101047,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101061,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[228] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101049,
				[2] = 1,
			},
			[2] = {
				[1] = 101049,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101063,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[229] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101051,
				[2] = 1,
			},
			[2] = {
				[1] = 101051,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101065,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[230] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101053,
				[2] = 1,
			},
			[2] = {
				[1] = 101053,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101067,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[231] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101055,
				[2] = 1,
			},
			[2] = {
				[1] = 101055,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101069,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[232] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101057,
				[2] = 1,
			},
			[2] = {
				[1] = 101057,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101071,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[233] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101059,
				[2] = 1,
			},
			[2] = {
				[1] = 101059,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101073,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[234] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101061,
				[2] = 1,
			},
			[2] = {
				[1] = 101061,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101075,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[235] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101063,
				[2] = 1,
			},
			[2] = {
				[1] = 101063,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101077,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[236] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101065,
				[2] = 1,
			},
			[2] = {
				[1] = 101065,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101079,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[237] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101067,
				[2] = 1,
			},
			[2] = {
				[1] = 101067,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101081,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[238] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101069,
				[2] = 1,
			},
			[2] = {
				[1] = 101069,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101083,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[239] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101071,
				[2] = 1,
			},
			[2] = {
				[1] = 101071,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101085,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[240] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101073,
				[2] = 1,
			},
			[2] = {
				[1] = 101073,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101087,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[241] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101075,
				[2] = 1,
			},
			[2] = {
				[1] = 101075,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101089,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[242] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101077,
				[2] = 1,
			},
			[2] = {
				[1] = 101077,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101091,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[243] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101079,
				[2] = 1,
			},
			[2] = {
				[1] = 101079,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101093,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[244] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101040,
				[2] = 1,
			},
			[2] = {
				[1] = 101040,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101054,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[245] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101042,
				[2] = 1,
			},
			[2] = {
				[1] = 101042,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101056,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[246] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101044,
				[2] = 1,
			},
			[2] = {
				[1] = 101044,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101058,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[247] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101046,
				[2] = 1,
			},
			[2] = {
				[1] = 101046,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101060,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[248] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101048,
				[2] = 1,
			},
			[2] = {
				[1] = 101048,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101062,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[249] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101050,
				[2] = 1,
			},
			[2] = {
				[1] = 101050,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101064,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[250] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101052,
				[2] = 1,
			},
			[2] = {
				[1] = 101052,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101066,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[251] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101054,
				[2] = 1,
			},
			[2] = {
				[1] = 101054,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101068,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[252] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101056,
				[2] = 1,
			},
			[2] = {
				[1] = 101056,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101070,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[253] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101058,
				[2] = 1,
			},
			[2] = {
				[1] = 101058,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101072,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[254] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101060,
				[2] = 1,
			},
			[2] = {
				[1] = 101060,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101074,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[255] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101062,
				[2] = 1,
			},
			[2] = {
				[1] = 101062,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101076,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[256] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101064,
				[2] = 1,
			},
			[2] = {
				[1] = 101064,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101078,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[257] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101066,
				[2] = 1,
			},
			[2] = {
				[1] = 101066,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101080,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[258] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101068,
				[2] = 1,
			},
			[2] = {
				[1] = 101068,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101082,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[259] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101070,
				[2] = 1,
			},
			[2] = {
				[1] = 101070,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101084,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[260] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101072,
				[2] = 1,
			},
			[2] = {
				[1] = 101072,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101086,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[261] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101074,
				[2] = 1,
			},
			[2] = {
				[1] = 101074,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101088,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[262] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101076,
				[2] = 1,
			},
			[2] = {
				[1] = 101076,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101090,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[263] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101078,
				[2] = 1,
			},
			[2] = {
				[1] = 101078,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101092,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[264] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101080,
				[2] = 1,
			},
			[2] = {
				[1] = 101080,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101094,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[265] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101920,
				[2] = 1,
			},
			[2] = {
				[1] = 101920,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101927,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[266] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101921,
				[2] = 1,
			},
			[2] = {
				[1] = 101921,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101928,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[267] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101922,
				[2] = 1,
			},
			[2] = {
				[1] = 101922,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101929,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[268] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101923,
				[2] = 1,
			},
			[2] = {
				[1] = 101923,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101930,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[269] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101924,
				[2] = 1,
			},
			[2] = {
				[1] = 101924,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101931,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[270] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101925,
				[2] = 1,
			},
			[2] = {
				[1] = 101925,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101932,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[271] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101926,
				[2] = 1,
			},
			[2] = {
				[1] = 101926,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101933,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[272] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101927,
				[2] = 1,
			},
			[2] = {
				[1] = 101927,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101934,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[273] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101928,
				[2] = 1,
			},
			[2] = {
				[1] = 101928,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101935,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[274] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101929,
				[2] = 1,
			},
			[2] = {
				[1] = 101929,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101936,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[275] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101930,
				[2] = 1,
			},
			[2] = {
				[1] = 101930,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101937,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[276] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101931,
				[2] = 1,
			},
			[2] = {
				[1] = 101931,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101938,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[277] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101932,
				[2] = 1,
			},
			[2] = {
				[1] = 101932,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101939,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[278] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101933,
				[2] = 1,
			},
			[2] = {
				[1] = 101933,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101940,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[279] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101934,
				[2] = 1,
			},
			[2] = {
				[1] = 101934,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101941,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[280] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101935,
				[2] = 1,
			},
			[2] = {
				[1] = 101935,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101942,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[281] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101936,
				[2] = 1,
			},
			[2] = {
				[1] = 101936,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101943,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[282] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101937,
				[2] = 1,
			},
			[2] = {
				[1] = 101937,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101944,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[283] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101938,
				[2] = 1,
			},
			[2] = {
				[1] = 101938,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101945,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[284] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101939,
				[2] = 1,
			},
			[2] = {
				[1] = 101939,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101946,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[285] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101940,
				[2] = 1,
			},
			[2] = {
				[1] = 101940,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 14400000,
			},
		},
		product = {
			[1] = {
				[1] = 101947,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[286] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102220,
				[2] = 1,
			},
			[2] = {
				[1] = 102220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102227,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[287] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102221,
				[2] = 1,
			},
			[2] = {
				[1] = 102221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102228,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[288] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102222,
				[2] = 1,
			},
			[2] = {
				[1] = 102222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102229,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[289] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102223,
				[2] = 1,
			},
			[2] = {
				[1] = 102223,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102230,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[290] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102224,
				[2] = 1,
			},
			[2] = {
				[1] = 102224,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102231,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[291] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102225,
				[2] = 1,
			},
			[2] = {
				[1] = 102225,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102232,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[292] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102226,
				[2] = 1,
			},
			[2] = {
				[1] = 102226,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102233,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[293] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102227,
				[2] = 1,
			},
			[2] = {
				[1] = 102227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102234,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[294] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102228,
				[2] = 1,
			},
			[2] = {
				[1] = 102228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102235,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[295] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102229,
				[2] = 1,
			},
			[2] = {
				[1] = 102229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102236,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[296] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102230,
				[2] = 1,
			},
			[2] = {
				[1] = 102230,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102237,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[297] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102231,
				[2] = 1,
			},
			[2] = {
				[1] = 102231,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102238,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[298] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102232,
				[2] = 1,
			},
			[2] = {
				[1] = 102232,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102239,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[299] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102233,
				[2] = 1,
			},
			[2] = {
				[1] = 102233,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102240,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[300] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102234,
				[2] = 1,
			},
			[2] = {
				[1] = 102234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102241,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[301] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102235,
				[2] = 1,
			},
			[2] = {
				[1] = 102235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102242,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[302] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102236,
				[2] = 1,
			},
			[2] = {
				[1] = 102236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102243,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[303] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102237,
				[2] = 1,
			},
			[2] = {
				[1] = 102237,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102244,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[304] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102238,
				[2] = 1,
			},
			[2] = {
				[1] = 102238,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102245,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[305] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102239,
				[2] = 1,
			},
			[2] = {
				[1] = 102239,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102246,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[306] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102240,
				[2] = 1,
			},
			[2] = {
				[1] = 102240,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 102247,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[307] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112220,
				[2] = 1,
			},
			[2] = {
				[1] = 112220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112227,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[308] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112221,
				[2] = 1,
			},
			[2] = {
				[1] = 112221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112228,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[309] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112222,
				[2] = 1,
			},
			[2] = {
				[1] = 112222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112229,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[310] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112223,
				[2] = 1,
			},
			[2] = {
				[1] = 112223,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112230,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[311] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112224,
				[2] = 1,
			},
			[2] = {
				[1] = 112224,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112231,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[312] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112225,
				[2] = 1,
			},
			[2] = {
				[1] = 112225,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112232,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[313] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112226,
				[2] = 1,
			},
			[2] = {
				[1] = 112226,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112233,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[314] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112227,
				[2] = 1,
			},
			[2] = {
				[1] = 112227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112234,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[315] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112228,
				[2] = 1,
			},
			[2] = {
				[1] = 112228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112235,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[316] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112229,
				[2] = 1,
			},
			[2] = {
				[1] = 112229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112236,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[317] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112230,
				[2] = 1,
			},
			[2] = {
				[1] = 112230,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112237,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[318] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112231,
				[2] = 1,
			},
			[2] = {
				[1] = 112231,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112238,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[319] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112232,
				[2] = 1,
			},
			[2] = {
				[1] = 112232,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112239,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[320] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112233,
				[2] = 1,
			},
			[2] = {
				[1] = 112233,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112240,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[321] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112234,
				[2] = 1,
			},
			[2] = {
				[1] = 112234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112241,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[322] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112235,
				[2] = 1,
			},
			[2] = {
				[1] = 112235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112242,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[323] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112236,
				[2] = 1,
			},
			[2] = {
				[1] = 112236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112243,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[324] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112237,
				[2] = 1,
			},
			[2] = {
				[1] = 112237,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112244,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[325] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112238,
				[2] = 1,
			},
			[2] = {
				[1] = 112238,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112245,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[326] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112239,
				[2] = 1,
			},
			[2] = {
				[1] = 112239,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112246,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[327] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112240,
				[2] = 1,
			},
			[2] = {
				[1] = 112240,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 112247,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[328] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102620,
				[2] = 1,
			},
			[2] = {
				[1] = 102620,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102627,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[329] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102621,
				[2] = 1,
			},
			[2] = {
				[1] = 102621,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102628,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[330] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102622,
				[2] = 1,
			},
			[2] = {
				[1] = 102622,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102629,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[331] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102623,
				[2] = 1,
			},
			[2] = {
				[1] = 102623,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102630,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[332] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102624,
				[2] = 1,
			},
			[2] = {
				[1] = 102624,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102631,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[333] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102625,
				[2] = 1,
			},
			[2] = {
				[1] = 102625,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102632,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[334] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102626,
				[2] = 1,
			},
			[2] = {
				[1] = 102626,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102633,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[335] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102627,
				[2] = 1,
			},
			[2] = {
				[1] = 102627,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102634,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[336] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102628,
				[2] = 1,
			},
			[2] = {
				[1] = 102628,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102635,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[337] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102629,
				[2] = 1,
			},
			[2] = {
				[1] = 102629,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102636,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[338] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102630,
				[2] = 1,
			},
			[2] = {
				[1] = 102630,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102637,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[339] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102631,
				[2] = 1,
			},
			[2] = {
				[1] = 102631,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102638,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[340] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102632,
				[2] = 1,
			},
			[2] = {
				[1] = 102632,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102639,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[341] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102633,
				[2] = 1,
			},
			[2] = {
				[1] = 102633,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102640,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[342] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102634,
				[2] = 1,
			},
			[2] = {
				[1] = 102634,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102641,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[343] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102635,
				[2] = 1,
			},
			[2] = {
				[1] = 102635,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102642,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[344] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102636,
				[2] = 1,
			},
			[2] = {
				[1] = 102636,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102643,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[345] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102637,
				[2] = 1,
			},
			[2] = {
				[1] = 102637,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102644,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[346] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102638,
				[2] = 1,
			},
			[2] = {
				[1] = 102638,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102645,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[347] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102639,
				[2] = 1,
			},
			[2] = {
				[1] = 102639,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102646,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[348] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102640,
				[2] = 1,
			},
			[2] = {
				[1] = 102640,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102647,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[349] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101520,
				[2] = 1,
			},
			[2] = {
				[1] = 101520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101527,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[350] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101521,
				[2] = 1,
			},
			[2] = {
				[1] = 101521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101528,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[351] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101522,
				[2] = 1,
			},
			[2] = {
				[1] = 101522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101529,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[352] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101523,
				[2] = 1,
			},
			[2] = {
				[1] = 101523,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101530,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[353] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101524,
				[2] = 1,
			},
			[2] = {
				[1] = 101524,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101531,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[354] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101525,
				[2] = 1,
			},
			[2] = {
				[1] = 101525,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101532,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[355] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101526,
				[2] = 1,
			},
			[2] = {
				[1] = 101526,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[356] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101527,
				[2] = 1,
			},
			[2] = {
				[1] = 101527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101534,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[357] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101528,
				[2] = 1,
			},
			[2] = {
				[1] = 101528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101535,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[358] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101529,
				[2] = 1,
			},
			[2] = {
				[1] = 101529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101536,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[359] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101530,
				[2] = 1,
			},
			[2] = {
				[1] = 101530,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101537,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[360] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101531,
				[2] = 1,
			},
			[2] = {
				[1] = 101531,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101538,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[361] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101532,
				[2] = 1,
			},
			[2] = {
				[1] = 101532,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101539,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[362] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
			[2] = {
				[1] = 101533,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101540,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[363] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
			[2] = {
				[1] = 101533,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101541,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[364] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101535,
				[2] = 1,
			},
			[2] = {
				[1] = 101535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101542,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[365] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101536,
				[2] = 1,
			},
			[2] = {
				[1] = 101536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101543,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[366] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101537,
				[2] = 1,
			},
			[2] = {
				[1] = 101537,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101544,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[367] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101538,
				[2] = 1,
			},
			[2] = {
				[1] = 101538,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101545,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[368] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101539,
				[2] = 1,
			},
			[2] = {
				[1] = 101539,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101546,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[369] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101540,
				[2] = 1,
			},
			[2] = {
				[1] = 101540,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 101547,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[370] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105420,
				[2] = 1,
			},
			[2] = {
				[1] = 105420,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105427,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[371] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105421,
				[2] = 1,
			},
			[2] = {
				[1] = 105421,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105428,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[372] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105422,
				[2] = 1,
			},
			[2] = {
				[1] = 105422,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105429,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[373] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105423,
				[2] = 1,
			},
			[2] = {
				[1] = 105423,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105430,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[374] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105424,
				[2] = 1,
			},
			[2] = {
				[1] = 105424,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105431,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[375] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105425,
				[2] = 1,
			},
			[2] = {
				[1] = 105425,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105432,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[376] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105426,
				[2] = 1,
			},
			[2] = {
				[1] = 105426,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105433,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[377] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105427,
				[2] = 1,
			},
			[2] = {
				[1] = 105427,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105434,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[378] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105428,
				[2] = 1,
			},
			[2] = {
				[1] = 105428,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105435,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[379] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105429,
				[2] = 1,
			},
			[2] = {
				[1] = 105429,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105436,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[380] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105430,
				[2] = 1,
			},
			[2] = {
				[1] = 105430,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105437,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[381] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105431,
				[2] = 1,
			},
			[2] = {
				[1] = 105431,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105438,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[382] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105432,
				[2] = 1,
			},
			[2] = {
				[1] = 105432,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105439,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[383] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105433,
				[2] = 1,
			},
			[2] = {
				[1] = 105433,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105440,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[384] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105434,
				[2] = 1,
			},
			[2] = {
				[1] = 105434,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105441,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[385] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105435,
				[2] = 1,
			},
			[2] = {
				[1] = 105435,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105442,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[386] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105436,
				[2] = 1,
			},
			[2] = {
				[1] = 105436,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105443,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[387] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105437,
				[2] = 1,
			},
			[2] = {
				[1] = 105437,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105444,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[388] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105438,
				[2] = 1,
			},
			[2] = {
				[1] = 105438,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105445,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[389] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105439,
				[2] = 1,
			},
			[2] = {
				[1] = 105439,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105446,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[390] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105440,
				[2] = 1,
			},
			[2] = {
				[1] = 105440,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105447,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[391] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105220,
				[2] = 1,
			},
			[2] = {
				[1] = 105220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105227,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[392] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105221,
				[2] = 1,
			},
			[2] = {
				[1] = 105221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105228,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[393] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105222,
				[2] = 1,
			},
			[2] = {
				[1] = 105222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105229,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[394] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105223,
				[2] = 1,
			},
			[2] = {
				[1] = 105223,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105230,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[395] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105224,
				[2] = 1,
			},
			[2] = {
				[1] = 105224,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105231,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[396] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105225,
				[2] = 1,
			},
			[2] = {
				[1] = 105225,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105232,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[397] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105226,
				[2] = 1,
			},
			[2] = {
				[1] = 105226,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105233,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[398] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105227,
				[2] = 1,
			},
			[2] = {
				[1] = 105227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105234,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[399] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105228,
				[2] = 1,
			},
			[2] = {
				[1] = 105228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105235,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[400] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105229,
				[2] = 1,
			},
			[2] = {
				[1] = 105229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105236,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[401] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105230,
				[2] = 1,
			},
			[2] = {
				[1] = 105230,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105237,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[402] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105231,
				[2] = 1,
			},
			[2] = {
				[1] = 105231,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105238,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[403] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105232,
				[2] = 1,
			},
			[2] = {
				[1] = 105232,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105239,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[404] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105233,
				[2] = 1,
			},
			[2] = {
				[1] = 105233,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105240,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[405] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105234,
				[2] = 1,
			},
			[2] = {
				[1] = 105234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105241,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[406] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105235,
				[2] = 1,
			},
			[2] = {
				[1] = 105235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105242,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[407] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105236,
				[2] = 1,
			},
			[2] = {
				[1] = 105236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105243,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[408] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105237,
				[2] = 1,
			},
			[2] = {
				[1] = 105237,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105244,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[409] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105238,
				[2] = 1,
			},
			[2] = {
				[1] = 105238,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105245,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[410] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105239,
				[2] = 1,
			},
			[2] = {
				[1] = 105239,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105246,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[411] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105240,
				[2] = 1,
			},
			[2] = {
				[1] = 105240,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105247,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装进阶",
		probability = 3500,
		npcid = 255,
	},
	[412] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100520,
				[2] = 1,
			},
			[2] = {
				[1] = 100522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100523,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[413] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100522,
				[2] = 1,
			},
			[2] = {
				[1] = 100520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100523,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[414] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100520,
				[2] = 1,
			},
			[2] = {
				[1] = 100521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100524,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[415] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100521,
				[2] = 1,
			},
			[2] = {
				[1] = 100520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100524,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[416] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100521,
				[2] = 1,
			},
			[2] = {
				[1] = 100522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100525,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[417] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100522,
				[2] = 1,
			},
			[2] = {
				[1] = 100521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 100525,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[418] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100523,
				[2] = 1,
			},
			[2] = {
				[1] = 100521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100526,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[419] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100524,
				[2] = 1,
			},
			[2] = {
				[1] = 100522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100526,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[420] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100525,
				[2] = 1,
			},
			[2] = {
				[1] = 100520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100526,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[421] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100527,
				[2] = 1,
			},
			[2] = {
				[1] = 100529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100530,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[422] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100529,
				[2] = 1,
			},
			[2] = {
				[1] = 100527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100530,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[423] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100527,
				[2] = 1,
			},
			[2] = {
				[1] = 100528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100531,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[424] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100528,
				[2] = 1,
			},
			[2] = {
				[1] = 100527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100531,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[425] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100528,
				[2] = 1,
			},
			[2] = {
				[1] = 100529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100532,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[426] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100529,
				[2] = 1,
			},
			[2] = {
				[1] = 100528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 100532,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[427] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100530,
				[2] = 1,
			},
			[2] = {
				[1] = 100528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100533,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[428] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100531,
				[2] = 1,
			},
			[2] = {
				[1] = 100529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100533,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[429] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100532,
				[2] = 1,
			},
			[2] = {
				[1] = 100527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100533,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[430] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100534,
				[2] = 1,
			},
			[2] = {
				[1] = 100536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100537,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[431] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100536,
				[2] = 1,
			},
			[2] = {
				[1] = 100534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100537,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[432] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100534,
				[2] = 1,
			},
			[2] = {
				[1] = 100535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100538,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[433] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100535,
				[2] = 1,
			},
			[2] = {
				[1] = 100534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100538,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[434] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100535,
				[2] = 1,
			},
			[2] = {
				[1] = 100536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100539,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[435] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100536,
				[2] = 1,
			},
			[2] = {
				[1] = 100535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 100539,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[436] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100537,
				[2] = 1,
			},
			[2] = {
				[1] = 100535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100540,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[437] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100538,
				[2] = 1,
			},
			[2] = {
				[1] = 100536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100540,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[438] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100539,
				[2] = 1,
			},
			[2] = {
				[1] = 100534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100540,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[439] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100541,
				[2] = 1,
			},
			[2] = {
				[1] = 100543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100544,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[440] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100543,
				[2] = 1,
			},
			[2] = {
				[1] = 100541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100544,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[441] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100541,
				[2] = 1,
			},
			[2] = {
				[1] = 100542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100545,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[442] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100542,
				[2] = 1,
			},
			[2] = {
				[1] = 100541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100545,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[443] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100542,
				[2] = 1,
			},
			[2] = {
				[1] = 100543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100546,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[444] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100543,
				[2] = 1,
			},
			[2] = {
				[1] = 100542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 100546,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[445] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100544,
				[2] = 1,
			},
			[2] = {
				[1] = 100542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 100547,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[446] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100545,
				[2] = 1,
			},
			[2] = {
				[1] = 100543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 100547,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[447] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100546,
				[2] = 1,
			},
			[2] = {
				[1] = 100541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 100547,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[448] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101039,
				[2] = 1,
			},
			[2] = {
				[1] = 101043,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101045,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[449] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101043,
				[2] = 1,
			},
			[2] = {
				[1] = 101039,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101045,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[450] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101039,
				[2] = 1,
			},
			[2] = {
				[1] = 101041,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101047,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[451] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101041,
				[2] = 1,
			},
			[2] = {
				[1] = 101039,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101047,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[452] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101043,
				[2] = 1,
			},
			[2] = {
				[1] = 101041,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101049,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[453] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101041,
				[2] = 1,
			},
			[2] = {
				[1] = 101043,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101049,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[454] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101045,
				[2] = 1,
			},
			[2] = {
				[1] = 101041,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101051,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[455] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101047,
				[2] = 1,
			},
			[2] = {
				[1] = 101043,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101051,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[456] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101049,
				[2] = 1,
			},
			[2] = {
				[1] = 101039,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101051,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[457] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101053,
				[2] = 1,
			},
			[2] = {
				[1] = 101057,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101059,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[458] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101057,
				[2] = 1,
			},
			[2] = {
				[1] = 101053,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101059,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[459] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101053,
				[2] = 1,
			},
			[2] = {
				[1] = 101055,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101061,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[460] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101055,
				[2] = 1,
			},
			[2] = {
				[1] = 101053,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101061,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[461] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101057,
				[2] = 1,
			},
			[2] = {
				[1] = 101055,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101063,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[462] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101055,
				[2] = 1,
			},
			[2] = {
				[1] = 101057,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101063,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[463] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101059,
				[2] = 1,
			},
			[2] = {
				[1] = 101055,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101065,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[464] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101061,
				[2] = 1,
			},
			[2] = {
				[1] = 101057,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101065,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[465] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101063,
				[2] = 1,
			},
			[2] = {
				[1] = 101053,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101065,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[466] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101067,
				[2] = 1,
			},
			[2] = {
				[1] = 101071,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101073,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[467] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101071,
				[2] = 1,
			},
			[2] = {
				[1] = 101067,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101073,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[468] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101067,
				[2] = 1,
			},
			[2] = {
				[1] = 101069,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101075,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[469] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101069,
				[2] = 1,
			},
			[2] = {
				[1] = 101067,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101075,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[470] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101071,
				[2] = 1,
			},
			[2] = {
				[1] = 101069,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101077,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[471] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101069,
				[2] = 1,
			},
			[2] = {
				[1] = 101071,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101077,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[472] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101073,
				[2] = 1,
			},
			[2] = {
				[1] = 101069,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101079,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[473] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101075,
				[2] = 1,
			},
			[2] = {
				[1] = 101071,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101079,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[474] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101077,
				[2] = 1,
			},
			[2] = {
				[1] = 101067,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101079,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[475] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101081,
				[2] = 1,
			},
			[2] = {
				[1] = 101085,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101087,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[476] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101085,
				[2] = 1,
			},
			[2] = {
				[1] = 101081,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101087,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[477] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101081,
				[2] = 1,
			},
			[2] = {
				[1] = 101083,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101089,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[478] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101083,
				[2] = 1,
			},
			[2] = {
				[1] = 101081,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101089,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[479] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101085,
				[2] = 1,
			},
			[2] = {
				[1] = 101083,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101091,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[480] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101083,
				[2] = 1,
			},
			[2] = {
				[1] = 101085,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101091,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[481] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101087,
				[2] = 1,
			},
			[2] = {
				[1] = 101083,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101093,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[482] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101089,
				[2] = 1,
			},
			[2] = {
				[1] = 101085,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101093,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[483] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101091,
				[2] = 1,
			},
			[2] = {
				[1] = 101081,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101093,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[484] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101040,
				[2] = 1,
			},
			[2] = {
				[1] = 101044,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101046,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[485] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101044,
				[2] = 1,
			},
			[2] = {
				[1] = 101040,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101046,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[486] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101040,
				[2] = 1,
			},
			[2] = {
				[1] = 101042,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101048,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[487] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101042,
				[2] = 1,
			},
			[2] = {
				[1] = 101040,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101048,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[488] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101044,
				[2] = 1,
			},
			[2] = {
				[1] = 101042,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101050,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[489] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101042,
				[2] = 1,
			},
			[2] = {
				[1] = 101044,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3000000,
			},
		},
		product = {
			[1] = {
				[1] = 101050,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[490] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101046,
				[2] = 1,
			},
			[2] = {
				[1] = 101042,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101052,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[491] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101048,
				[2] = 1,
			},
			[2] = {
				[1] = 101044,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101052,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[492] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101050,
				[2] = 1,
			},
			[2] = {
				[1] = 101040,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101052,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[493] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101054,
				[2] = 1,
			},
			[2] = {
				[1] = 101058,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101060,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[494] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101058,
				[2] = 1,
			},
			[2] = {
				[1] = 101054,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101060,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[495] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101054,
				[2] = 1,
			},
			[2] = {
				[1] = 101056,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101062,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[496] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101056,
				[2] = 1,
			},
			[2] = {
				[1] = 101054,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101062,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[497] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101058,
				[2] = 1,
			},
			[2] = {
				[1] = 101056,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101064,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[498] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101056,
				[2] = 1,
			},
			[2] = {
				[1] = 101058,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 101064,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[499] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101060,
				[2] = 1,
			},
			[2] = {
				[1] = 101056,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101066,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[500] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101062,
				[2] = 1,
			},
			[2] = {
				[1] = 101058,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101066,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[501] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101064,
				[2] = 1,
			},
			[2] = {
				[1] = 101054,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101066,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[502] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101068,
				[2] = 1,
			},
			[2] = {
				[1] = 101072,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101074,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[503] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101072,
				[2] = 1,
			},
			[2] = {
				[1] = 101068,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101074,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[504] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101068,
				[2] = 1,
			},
			[2] = {
				[1] = 101070,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101076,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[505] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101070,
				[2] = 1,
			},
			[2] = {
				[1] = 101068,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101076,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[506] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101072,
				[2] = 1,
			},
			[2] = {
				[1] = 101070,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101078,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[507] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101070,
				[2] = 1,
			},
			[2] = {
				[1] = 101072,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101078,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[508] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101074,
				[2] = 1,
			},
			[2] = {
				[1] = 101070,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101080,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[509] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101076,
				[2] = 1,
			},
			[2] = {
				[1] = 101072,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101080,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[510] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101078,
				[2] = 1,
			},
			[2] = {
				[1] = 101068,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101080,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[511] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101082,
				[2] = 1,
			},
			[2] = {
				[1] = 101086,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101088,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[512] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101086,
				[2] = 1,
			},
			[2] = {
				[1] = 101082,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101088,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[513] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101082,
				[2] = 1,
			},
			[2] = {
				[1] = 101084,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101090,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[514] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101084,
				[2] = 1,
			},
			[2] = {
				[1] = 101082,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101090,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[515] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101086,
				[2] = 1,
			},
			[2] = {
				[1] = 101084,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101092,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[516] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101084,
				[2] = 1,
			},
			[2] = {
				[1] = 101086,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101092,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[517] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101088,
				[2] = 1,
			},
			[2] = {
				[1] = 101084,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101094,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[518] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101090,
				[2] = 1,
			},
			[2] = {
				[1] = 101086,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101094,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[519] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101092,
				[2] = 1,
			},
			[2] = {
				[1] = 101082,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101094,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[520] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101920,
				[2] = 1,
			},
			[2] = {
				[1] = 101921,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101923,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[521] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101921,
				[2] = 1,
			},
			[2] = {
				[1] = 101920,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101923,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[522] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101921,
				[2] = 1,
			},
			[2] = {
				[1] = 101922,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101924,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[523] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101922,
				[2] = 1,
			},
			[2] = {
				[1] = 101921,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101924,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[524] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101920,
				[2] = 1,
			},
			[2] = {
				[1] = 101922,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101925,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[525] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101922,
				[2] = 1,
			},
			[2] = {
				[1] = 101920,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 900000,
			},
		},
		product = {
			[1] = {
				[1] = 101925,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[526] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101923,
				[2] = 1,
			},
			[2] = {
				[1] = 101922,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101926,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[527] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101924,
				[2] = 1,
			},
			[2] = {
				[1] = 101920,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101926,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[528] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101925,
				[2] = 1,
			},
			[2] = {
				[1] = 101921,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101926,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[529] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101927,
				[2] = 1,
			},
			[2] = {
				[1] = 101928,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101930,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[530] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101928,
				[2] = 1,
			},
			[2] = {
				[1] = 101927,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101930,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[531] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101928,
				[2] = 1,
			},
			[2] = {
				[1] = 101929,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101931,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[532] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101929,
				[2] = 1,
			},
			[2] = {
				[1] = 101928,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101931,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[533] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101927,
				[2] = 1,
			},
			[2] = {
				[1] = 101929,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101932,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[534] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101929,
				[2] = 1,
			},
			[2] = {
				[1] = 101927,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1800000,
			},
		},
		product = {
			[1] = {
				[1] = 101932,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[535] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101930,
				[2] = 1,
			},
			[2] = {
				[1] = 101929,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101933,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[536] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101931,
				[2] = 1,
			},
			[2] = {
				[1] = 101927,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101933,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[537] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101932,
				[2] = 1,
			},
			[2] = {
				[1] = 101928,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101933,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[538] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101934,
				[2] = 1,
			},
			[2] = {
				[1] = 101935,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101937,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[539] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101935,
				[2] = 1,
			},
			[2] = {
				[1] = 101934,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101937,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[540] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101935,
				[2] = 1,
			},
			[2] = {
				[1] = 101936,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101938,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[541] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101936,
				[2] = 1,
			},
			[2] = {
				[1] = 101935,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101938,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[542] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101934,
				[2] = 1,
			},
			[2] = {
				[1] = 101936,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101939,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[543] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101936,
				[2] = 1,
			},
			[2] = {
				[1] = 101934,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 3600000,
			},
		},
		product = {
			[1] = {
				[1] = 101939,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[544] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101937,
				[2] = 1,
			},
			[2] = {
				[1] = 101936,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101940,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[545] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101938,
				[2] = 1,
			},
			[2] = {
				[1] = 101934,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101940,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[546] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101939,
				[2] = 1,
			},
			[2] = {
				[1] = 101935,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101940,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[547] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101941,
				[2] = 1,
			},
			[2] = {
				[1] = 101942,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101944,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[548] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101942,
				[2] = 1,
			},
			[2] = {
				[1] = 101941,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101944,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[549] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101942,
				[2] = 1,
			},
			[2] = {
				[1] = 101943,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101945,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[550] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101943,
				[2] = 1,
			},
			[2] = {
				[1] = 101942,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101945,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[551] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101941,
				[2] = 1,
			},
			[2] = {
				[1] = 101943,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101946,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[552] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101943,
				[2] = 1,
			},
			[2] = {
				[1] = 101941,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 7200000,
			},
		},
		product = {
			[1] = {
				[1] = 101946,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[553] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101944,
				[2] = 1,
			},
			[2] = {
				[1] = 101943,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 14400000,
			},
		},
		product = {
			[1] = {
				[1] = 101947,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[554] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101945,
				[2] = 1,
			},
			[2] = {
				[1] = 101941,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 14400000,
			},
		},
		product = {
			[1] = {
				[1] = 101947,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[555] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101946,
				[2] = 1,
			},
			[2] = {
				[1] = 101942,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 14400000,
			},
		},
		product = {
			[1] = {
				[1] = 101947,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[556] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102220,
				[2] = 1,
			},
			[2] = {
				[1] = 102221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102223,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[557] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102221,
				[2] = 1,
			},
			[2] = {
				[1] = 102220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102223,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[558] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102220,
				[2] = 1,
			},
			[2] = {
				[1] = 102222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102224,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[559] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102222,
				[2] = 1,
			},
			[2] = {
				[1] = 102220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102224,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[560] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102221,
				[2] = 1,
			},
			[2] = {
				[1] = 102222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102225,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[561] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102222,
				[2] = 1,
			},
			[2] = {
				[1] = 102221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102225,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[562] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102223,
				[2] = 1,
			},
			[2] = {
				[1] = 102222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102226,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[563] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102224,
				[2] = 1,
			},
			[2] = {
				[1] = 102221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102226,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[564] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102225,
				[2] = 1,
			},
			[2] = {
				[1] = 102220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102226,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[565] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102227,
				[2] = 1,
			},
			[2] = {
				[1] = 102228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102230,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[566] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102228,
				[2] = 1,
			},
			[2] = {
				[1] = 102227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102230,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[567] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102227,
				[2] = 1,
			},
			[2] = {
				[1] = 102229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102231,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[568] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102229,
				[2] = 1,
			},
			[2] = {
				[1] = 102227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102231,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[569] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102228,
				[2] = 1,
			},
			[2] = {
				[1] = 102229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102232,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[570] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102229,
				[2] = 1,
			},
			[2] = {
				[1] = 102228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102232,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[571] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102230,
				[2] = 1,
			},
			[2] = {
				[1] = 102229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102233,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[572] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102231,
				[2] = 1,
			},
			[2] = {
				[1] = 102228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102233,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[573] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102232,
				[2] = 1,
			},
			[2] = {
				[1] = 102227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102233,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[574] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102234,
				[2] = 1,
			},
			[2] = {
				[1] = 102235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102237,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[575] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102235,
				[2] = 1,
			},
			[2] = {
				[1] = 102234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102237,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[576] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102234,
				[2] = 1,
			},
			[2] = {
				[1] = 102236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102238,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[577] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102236,
				[2] = 1,
			},
			[2] = {
				[1] = 102234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102238,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[578] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102235,
				[2] = 1,
			},
			[2] = {
				[1] = 102236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102239,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[579] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102236,
				[2] = 1,
			},
			[2] = {
				[1] = 102235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102239,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[580] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102237,
				[2] = 1,
			},
			[2] = {
				[1] = 102236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102240,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[581] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102238,
				[2] = 1,
			},
			[2] = {
				[1] = 102235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102240,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[582] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102239,
				[2] = 1,
			},
			[2] = {
				[1] = 102234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102240,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[583] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102241,
				[2] = 1,
			},
			[2] = {
				[1] = 102242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102244,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[584] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102242,
				[2] = 1,
			},
			[2] = {
				[1] = 102241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102244,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[585] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102241,
				[2] = 1,
			},
			[2] = {
				[1] = 102243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102245,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[586] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102243,
				[2] = 1,
			},
			[2] = {
				[1] = 102241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102245,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[587] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102242,
				[2] = 1,
			},
			[2] = {
				[1] = 102243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102246,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[588] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102243,
				[2] = 1,
			},
			[2] = {
				[1] = 102242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102246,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[589] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102244,
				[2] = 1,
			},
			[2] = {
				[1] = 102243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 102247,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[590] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102245,
				[2] = 1,
			},
			[2] = {
				[1] = 102242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 102247,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[591] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102246,
				[2] = 1,
			},
			[2] = {
				[1] = 102241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 102247,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[592] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112220,
				[2] = 1,
			},
			[2] = {
				[1] = 112221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112223,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[593] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112221,
				[2] = 1,
			},
			[2] = {
				[1] = 112220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112223,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[594] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112220,
				[2] = 1,
			},
			[2] = {
				[1] = 112222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112224,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[595] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112222,
				[2] = 1,
			},
			[2] = {
				[1] = 112220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112224,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[596] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112221,
				[2] = 1,
			},
			[2] = {
				[1] = 112222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112225,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[597] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112222,
				[2] = 1,
			},
			[2] = {
				[1] = 112221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 112225,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[598] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112223,
				[2] = 1,
			},
			[2] = {
				[1] = 112222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112226,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[599] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112224,
				[2] = 1,
			},
			[2] = {
				[1] = 112221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112226,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[600] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112225,
				[2] = 1,
			},
			[2] = {
				[1] = 112220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112226,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[601] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112227,
				[2] = 1,
			},
			[2] = {
				[1] = 112228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112230,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[602] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112228,
				[2] = 1,
			},
			[2] = {
				[1] = 112227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112230,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[603] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112227,
				[2] = 1,
			},
			[2] = {
				[1] = 112229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112231,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[604] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112229,
				[2] = 1,
			},
			[2] = {
				[1] = 112227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112231,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[605] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112228,
				[2] = 1,
			},
			[2] = {
				[1] = 112229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112232,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[606] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112229,
				[2] = 1,
			},
			[2] = {
				[1] = 112228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 112232,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[607] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112230,
				[2] = 1,
			},
			[2] = {
				[1] = 112229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112233,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[608] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112231,
				[2] = 1,
			},
			[2] = {
				[1] = 112228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112233,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[609] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112232,
				[2] = 1,
			},
			[2] = {
				[1] = 112227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112233,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[610] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112234,
				[2] = 1,
			},
			[2] = {
				[1] = 112235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112237,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[611] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112235,
				[2] = 1,
			},
			[2] = {
				[1] = 112234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112237,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[612] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112234,
				[2] = 1,
			},
			[2] = {
				[1] = 112236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112238,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[613] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112236,
				[2] = 1,
			},
			[2] = {
				[1] = 112234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112238,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[614] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112235,
				[2] = 1,
			},
			[2] = {
				[1] = 112236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112239,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[615] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112236,
				[2] = 1,
			},
			[2] = {
				[1] = 112235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 112239,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[616] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112237,
				[2] = 1,
			},
			[2] = {
				[1] = 112236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112240,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[617] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112238,
				[2] = 1,
			},
			[2] = {
				[1] = 112235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112240,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[618] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112239,
				[2] = 1,
			},
			[2] = {
				[1] = 112234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112240,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[619] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112241,
				[2] = 1,
			},
			[2] = {
				[1] = 112242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112244,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[620] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112242,
				[2] = 1,
			},
			[2] = {
				[1] = 112241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112244,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[621] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112241,
				[2] = 1,
			},
			[2] = {
				[1] = 112243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112245,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[622] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112243,
				[2] = 1,
			},
			[2] = {
				[1] = 112241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112245,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[623] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112242,
				[2] = 1,
			},
			[2] = {
				[1] = 112243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112246,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[624] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112243,
				[2] = 1,
			},
			[2] = {
				[1] = 112242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 112246,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[625] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112244,
				[2] = 1,
			},
			[2] = {
				[1] = 112243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 112247,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[626] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112245,
				[2] = 1,
			},
			[2] = {
				[1] = 112242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 112247,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[627] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112246,
				[2] = 1,
			},
			[2] = {
				[1] = 112241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 9600000,
			},
		},
		product = {
			[1] = {
				[1] = 112247,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[628] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102620,
				[2] = 1,
			},
			[2] = {
				[1] = 102621,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102623,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[629] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102621,
				[2] = 1,
			},
			[2] = {
				[1] = 102620,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102623,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[630] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102620,
				[2] = 1,
			},
			[2] = {
				[1] = 102622,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102624,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[631] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102622,
				[2] = 1,
			},
			[2] = {
				[1] = 102620,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102624,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[632] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102621,
				[2] = 1,
			},
			[2] = {
				[1] = 102622,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102625,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[633] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102622,
				[2] = 1,
			},
			[2] = {
				[1] = 102621,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 102625,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[634] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102623,
				[2] = 1,
			},
			[2] = {
				[1] = 102622,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102626,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[635] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102624,
				[2] = 1,
			},
			[2] = {
				[1] = 102621,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102626,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[636] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102625,
				[2] = 1,
			},
			[2] = {
				[1] = 102620,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102626,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[637] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102627,
				[2] = 1,
			},
			[2] = {
				[1] = 102628,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102630,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[638] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102628,
				[2] = 1,
			},
			[2] = {
				[1] = 102627,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102630,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[639] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102627,
				[2] = 1,
			},
			[2] = {
				[1] = 102629,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102631,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[640] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102629,
				[2] = 1,
			},
			[2] = {
				[1] = 102627,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102631,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[641] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102628,
				[2] = 1,
			},
			[2] = {
				[1] = 102629,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102632,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[642] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102629,
				[2] = 1,
			},
			[2] = {
				[1] = 102628,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 102632,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[643] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102630,
				[2] = 1,
			},
			[2] = {
				[1] = 102629,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102633,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[644] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102631,
				[2] = 1,
			},
			[2] = {
				[1] = 102628,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102633,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[645] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102632,
				[2] = 1,
			},
			[2] = {
				[1] = 102627,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102633,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[646] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102634,
				[2] = 1,
			},
			[2] = {
				[1] = 102635,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102637,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[647] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102635,
				[2] = 1,
			},
			[2] = {
				[1] = 102634,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102637,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[648] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102634,
				[2] = 1,
			},
			[2] = {
				[1] = 102636,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102638,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[649] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102636,
				[2] = 1,
			},
			[2] = {
				[1] = 102634,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102638,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[650] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102635,
				[2] = 1,
			},
			[2] = {
				[1] = 102636,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102639,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[651] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102636,
				[2] = 1,
			},
			[2] = {
				[1] = 102635,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 102639,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[652] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102637,
				[2] = 1,
			},
			[2] = {
				[1] = 102636,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102640,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[653] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102638,
				[2] = 1,
			},
			[2] = {
				[1] = 102635,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102640,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[654] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102639,
				[2] = 1,
			},
			[2] = {
				[1] = 102634,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102640,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[655] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102641,
				[2] = 1,
			},
			[2] = {
				[1] = 102642,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102644,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[656] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102642,
				[2] = 1,
			},
			[2] = {
				[1] = 102641,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102644,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[657] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102641,
				[2] = 1,
			},
			[2] = {
				[1] = 102643,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102645,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[658] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102643,
				[2] = 1,
			},
			[2] = {
				[1] = 102641,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102645,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[659] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102642,
				[2] = 1,
			},
			[2] = {
				[1] = 102643,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102646,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[660] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102643,
				[2] = 1,
			},
			[2] = {
				[1] = 102642,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 102646,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[661] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102644,
				[2] = 1,
			},
			[2] = {
				[1] = 102643,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102647,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[662] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102645,
				[2] = 1,
			},
			[2] = {
				[1] = 102642,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102647,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[663] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102646,
				[2] = 1,
			},
			[2] = {
				[1] = 102641,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 102647,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[664] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101520,
				[2] = 1,
			},
			[2] = {
				[1] = 101521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101523,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[665] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101521,
				[2] = 1,
			},
			[2] = {
				[1] = 101520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101523,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[666] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101520,
				[2] = 1,
			},
			[2] = {
				[1] = 101522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101524,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[667] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101522,
				[2] = 1,
			},
			[2] = {
				[1] = 101520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101524,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[668] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101521,
				[2] = 1,
			},
			[2] = {
				[1] = 101522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101525,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[669] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101522,
				[2] = 1,
			},
			[2] = {
				[1] = 101521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 101525,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[670] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101523,
				[2] = 1,
			},
			[2] = {
				[1] = 101522,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101526,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[671] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101524,
				[2] = 1,
			},
			[2] = {
				[1] = 101521,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101526,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[672] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101525,
				[2] = 1,
			},
			[2] = {
				[1] = 101520,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101526,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[673] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101527,
				[2] = 1,
			},
			[2] = {
				[1] = 101528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101530,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[674] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101528,
				[2] = 1,
			},
			[2] = {
				[1] = 101527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101530,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[675] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101527,
				[2] = 1,
			},
			[2] = {
				[1] = 101529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101531,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[676] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101529,
				[2] = 1,
			},
			[2] = {
				[1] = 101527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101531,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[677] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101528,
				[2] = 1,
			},
			[2] = {
				[1] = 101529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101532,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[678] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101529,
				[2] = 1,
			},
			[2] = {
				[1] = 101528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 101532,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[679] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101530,
				[2] = 1,
			},
			[2] = {
				[1] = 101529,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[680] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101531,
				[2] = 1,
			},
			[2] = {
				[1] = 101528,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[681] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101532,
				[2] = 1,
			},
			[2] = {
				[1] = 101527,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101533,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[682] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101534,
				[2] = 1,
			},
			[2] = {
				[1] = 101535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101537,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[683] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101535,
				[2] = 1,
			},
			[2] = {
				[1] = 101534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101537,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[684] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101534,
				[2] = 1,
			},
			[2] = {
				[1] = 101536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101538,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[685] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101536,
				[2] = 1,
			},
			[2] = {
				[1] = 101534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101538,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[686] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101535,
				[2] = 1,
			},
			[2] = {
				[1] = 101536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101539,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[687] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101536,
				[2] = 1,
			},
			[2] = {
				[1] = 101535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 101539,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[688] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101537,
				[2] = 1,
			},
			[2] = {
				[1] = 101536,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101540,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[689] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101538,
				[2] = 1,
			},
			[2] = {
				[1] = 101535,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101540,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[690] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101539,
				[2] = 1,
			},
			[2] = {
				[1] = 101534,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101540,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[691] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101541,
				[2] = 1,
			},
			[2] = {
				[1] = 101542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101544,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[692] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101542,
				[2] = 1,
			},
			[2] = {
				[1] = 101541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101544,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[693] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101541,
				[2] = 1,
			},
			[2] = {
				[1] = 101543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101545,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[694] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101543,
				[2] = 1,
			},
			[2] = {
				[1] = 101541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101545,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[695] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101542,
				[2] = 1,
			},
			[2] = {
				[1] = 101543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101546,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[696] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101543,
				[2] = 1,
			},
			[2] = {
				[1] = 101542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 101546,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[697] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101544,
				[2] = 1,
			},
			[2] = {
				[1] = 101543,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 101547,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[698] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101545,
				[2] = 1,
			},
			[2] = {
				[1] = 101542,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 101547,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[699] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101546,
				[2] = 1,
			},
			[2] = {
				[1] = 101541,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 101547,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[700] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105420,
				[2] = 1,
			},
			[2] = {
				[1] = 105421,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105423,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[701] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105421,
				[2] = 1,
			},
			[2] = {
				[1] = 105420,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105423,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[702] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105420,
				[2] = 1,
			},
			[2] = {
				[1] = 105422,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105424,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[703] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105422,
				[2] = 1,
			},
			[2] = {
				[1] = 105420,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105424,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[704] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105421,
				[2] = 1,
			},
			[2] = {
				[1] = 105422,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105425,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[705] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105422,
				[2] = 1,
			},
			[2] = {
				[1] = 105421,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105425,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[706] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105423,
				[2] = 1,
			},
			[2] = {
				[1] = 105422,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105426,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[707] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105424,
				[2] = 1,
			},
			[2] = {
				[1] = 105421,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105426,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[708] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105425,
				[2] = 1,
			},
			[2] = {
				[1] = 105420,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105426,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[709] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105427,
				[2] = 1,
			},
			[2] = {
				[1] = 105428,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105430,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[710] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105428,
				[2] = 1,
			},
			[2] = {
				[1] = 105427,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105430,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[711] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105427,
				[2] = 1,
			},
			[2] = {
				[1] = 105429,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105431,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[712] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105429,
				[2] = 1,
			},
			[2] = {
				[1] = 105427,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105431,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[713] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105428,
				[2] = 1,
			},
			[2] = {
				[1] = 105429,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105432,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[714] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105429,
				[2] = 1,
			},
			[2] = {
				[1] = 105428,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105432,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[715] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105430,
				[2] = 1,
			},
			[2] = {
				[1] = 105429,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105433,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[716] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105431,
				[2] = 1,
			},
			[2] = {
				[1] = 105428,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105433,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[717] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105432,
				[2] = 1,
			},
			[2] = {
				[1] = 105427,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105433,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[718] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105434,
				[2] = 1,
			},
			[2] = {
				[1] = 105435,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105437,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[719] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105435,
				[2] = 1,
			},
			[2] = {
				[1] = 105434,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105437,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[720] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105434,
				[2] = 1,
			},
			[2] = {
				[1] = 105436,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105438,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[721] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105436,
				[2] = 1,
			},
			[2] = {
				[1] = 105434,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105438,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[722] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105435,
				[2] = 1,
			},
			[2] = {
				[1] = 105436,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105439,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[723] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105436,
				[2] = 1,
			},
			[2] = {
				[1] = 105435,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105439,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[724] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105437,
				[2] = 1,
			},
			[2] = {
				[1] = 105436,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105440,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[725] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105438,
				[2] = 1,
			},
			[2] = {
				[1] = 105435,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105440,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[726] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105439,
				[2] = 1,
			},
			[2] = {
				[1] = 105434,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105440,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[727] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105441,
				[2] = 1,
			},
			[2] = {
				[1] = 105442,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105444,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[728] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105442,
				[2] = 1,
			},
			[2] = {
				[1] = 105441,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105444,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[729] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105441,
				[2] = 1,
			},
			[2] = {
				[1] = 105443,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105445,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[730] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105443,
				[2] = 1,
			},
			[2] = {
				[1] = 105441,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105445,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[731] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105442,
				[2] = 1,
			},
			[2] = {
				[1] = 105443,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105446,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[732] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105443,
				[2] = 1,
			},
			[2] = {
				[1] = 105442,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105446,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[733] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105444,
				[2] = 1,
			},
			[2] = {
				[1] = 105443,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105447,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[734] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105445,
				[2] = 1,
			},
			[2] = {
				[1] = 105442,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105447,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[735] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105446,
				[2] = 1,
			},
			[2] = {
				[1] = 105441,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105447,
				[2] = 1,
			},
		},
		name = "护腰",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[736] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105220,
				[2] = 1,
			},
			[2] = {
				[1] = 105221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105223,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[737] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105221,
				[2] = 1,
			},
			[2] = {
				[1] = 105220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105223,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[738] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105220,
				[2] = 1,
			},
			[2] = {
				[1] = 105222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105224,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[739] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105222,
				[2] = 1,
			},
			[2] = {
				[1] = 105220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105224,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[740] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105221,
				[2] = 1,
			},
			[2] = {
				[1] = 105222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105225,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[741] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105222,
				[2] = 1,
			},
			[2] = {
				[1] = 105221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 300000,
			},
		},
		product = {
			[1] = {
				[1] = 105225,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[742] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105223,
				[2] = 1,
			},
			[2] = {
				[1] = 105222,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105226,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[743] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105224,
				[2] = 1,
			},
			[2] = {
				[1] = 105221,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105226,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[744] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105225,
				[2] = 1,
			},
			[2] = {
				[1] = 105220,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105226,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[745] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105227,
				[2] = 1,
			},
			[2] = {
				[1] = 105228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105230,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[746] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 11,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105228,
				[2] = 1,
			},
			[2] = {
				[1] = 105227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105230,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[747] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 12,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105227,
				[2] = 1,
			},
			[2] = {
				[1] = 105229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105231,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[748] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 13,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105229,
				[2] = 1,
			},
			[2] = {
				[1] = 105227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105231,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[749] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 14,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105228,
				[2] = 1,
			},
			[2] = {
				[1] = 105229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105232,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[750] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 15,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105229,
				[2] = 1,
			},
			[2] = {
				[1] = 105228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 600000,
			},
		},
		product = {
			[1] = {
				[1] = 105232,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[751] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 16,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105230,
				[2] = 1,
			},
			[2] = {
				[1] = 105229,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105233,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[752] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 17,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105231,
				[2] = 1,
			},
			[2] = {
				[1] = 105228,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105233,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[753] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 18,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105232,
				[2] = 1,
			},
			[2] = {
				[1] = 105227,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105233,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[754] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 19,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105234,
				[2] = 1,
			},
			[2] = {
				[1] = 105235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105237,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[755] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 20,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105235,
				[2] = 1,
			},
			[2] = {
				[1] = 105234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105237,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[756] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 21,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105234,
				[2] = 1,
			},
			[2] = {
				[1] = 105236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105238,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[757] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 22,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105236,
				[2] = 1,
			},
			[2] = {
				[1] = 105234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105238,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[758] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 23,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105235,
				[2] = 1,
			},
			[2] = {
				[1] = 105236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105239,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[759] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 24,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105236,
				[2] = 1,
			},
			[2] = {
				[1] = 105235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 1200000,
			},
		},
		product = {
			[1] = {
				[1] = 105239,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[760] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 25,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105237,
				[2] = 1,
			},
			[2] = {
				[1] = 105236,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105240,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[761] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 26,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105238,
				[2] = 1,
			},
			[2] = {
				[1] = 105235,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105240,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[762] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 27,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105239,
				[2] = 1,
			},
			[2] = {
				[1] = 105234,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105240,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[763] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 28,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105241,
				[2] = 1,
			},
			[2] = {
				[1] = 105242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105244,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[764] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 29,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105242,
				[2] = 1,
			},
			[2] = {
				[1] = 105241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105244,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[765] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 30,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105241,
				[2] = 1,
			},
			[2] = {
				[1] = 105243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105245,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[766] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 31,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105243,
				[2] = 1,
			},
			[2] = {
				[1] = 105241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105245,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[767] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 32,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105242,
				[2] = 1,
			},
			[2] = {
				[1] = 105243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105246,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[768] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 33,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105243,
				[2] = 1,
			},
			[2] = {
				[1] = 105242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 2400000,
			},
		},
		product = {
			[1] = {
				[1] = 105246,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 3500,
		npcid = 256,
	},
	[769] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 34,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105244,
				[2] = 1,
			},
			[2] = {
				[1] = 105243,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105247,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[770] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 35,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105245,
				[2] = 1,
			},
			[2] = {
				[1] = 105242,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105247,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[771] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 36,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105246,
				[2] = 1,
			},
			[2] = {
				[1] = 105241,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 4800000,
			},
		},
		product = {
			[1] = {
				[1] = 105247,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "神装融合",
		probability = 2000,
		npcid = 256,
	},
	[772] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100547,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 100548,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[773] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100548,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 100549,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[774] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100549,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 100550,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[775] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100550,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 60000000,
			},
		},
		product = {
			[1] = {
				[1] = 100551,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[776] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100551,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 40,
			},
			[3] = {
				[1] = 4,
				[2] = 80000000,
			},
		},
		product = {
			[1] = {
				[1] = 100552,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[777] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100552,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 50,
			},
			[3] = {
				[1] = 4,
				[2] = 100000000,
			},
		},
		product = {
			[1] = {
				[1] = 100553,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[778] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100553,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 60,
			},
			[3] = {
				[1] = 4,
				[2] = 120000000,
			},
		},
		product = {
			[1] = {
				[1] = 100554,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[779] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100554,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 70,
			},
			[3] = {
				[1] = 4,
				[2] = 140000000,
			},
		},
		product = {
			[1] = {
				[1] = 100555,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[780] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100555,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 80,
			},
			[3] = {
				[1] = 4,
				[2] = 160000000,
			},
		},
		product = {
			[1] = {
				[1] = 100556,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[781] = {
		type = 2,
		page1 = 1,
		page2 = 1,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 100556,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 90,
			},
			[3] = {
				[1] = 4,
				[2] = 180000000,
			},
		},
		product = {
			[1] = {
				[1] = 100557,
				[2] = 1,
			},
		},
		name = "武器",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[782] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101093,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101095,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[783] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101095,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 101097,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[784] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101097,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101099,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[785] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101099,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 60000000,
			},
		},
		product = {
			[1] = {
				[1] = 101101,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[786] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101101,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 40,
			},
			[3] = {
				[1] = 4,
				[2] = 80000000,
			},
		},
		product = {
			[1] = {
				[1] = 101103,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[787] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101103,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 50,
			},
			[3] = {
				[1] = 4,
				[2] = 100000000,
			},
		},
		product = {
			[1] = {
				[1] = 101105,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[788] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101105,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 60,
			},
			[3] = {
				[1] = 4,
				[2] = 120000000,
			},
		},
		product = {
			[1] = {
				[1] = 101107,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[789] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101107,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 70,
			},
			[3] = {
				[1] = 4,
				[2] = 140000000,
			},
		},
		product = {
			[1] = {
				[1] = 101109,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[790] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101109,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 80,
			},
			[3] = {
				[1] = 4,
				[2] = 160000000,
			},
		},
		product = {
			[1] = {
				[1] = 101111,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[791] = {
		type = 2,
		page1 = 1,
		page2 = 2,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101111,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 90,
			},
			[3] = {
				[1] = 4,
				[2] = 180000000,
			},
		},
		product = {
			[1] = {
				[1] = 101113,
				[2] = 1,
			},
		},
		name = "男衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[792] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101094,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101096,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[793] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101096,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 101098,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[794] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101098,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101100,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[795] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101100,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 30,
			},
			[3] = {
				[1] = 4,
				[2] = 60000000,
			},
		},
		product = {
			[1] = {
				[1] = 101102,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[796] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101102,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 40,
			},
			[3] = {
				[1] = 4,
				[2] = 80000000,
			},
		},
		product = {
			[1] = {
				[1] = 101104,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[797] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101104,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 50,
			},
			[3] = {
				[1] = 4,
				[2] = 100000000,
			},
		},
		product = {
			[1] = {
				[1] = 101106,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[798] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101106,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 60,
			},
			[3] = {
				[1] = 4,
				[2] = 120000000,
			},
		},
		product = {
			[1] = {
				[1] = 101108,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[799] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101108,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 70,
			},
			[3] = {
				[1] = 4,
				[2] = 140000000,
			},
		},
		product = {
			[1] = {
				[1] = 101110,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[800] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101110,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 80,
			},
			[3] = {
				[1] = 4,
				[2] = 160000000,
			},
		},
		product = {
			[1] = {
				[1] = 101112,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[801] = {
		type = 2,
		page1 = 1,
		page2 = 3,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101112,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 90,
			},
			[3] = {
				[1] = 4,
				[2] = 180000000,
			},
		},
		product = {
			[1] = {
				[1] = 101114,
				[2] = 1,
			},
		},
		name = "女衣服",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[802] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101547,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 101548,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[803] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101548,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 101549,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[804] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101549,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 101550,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[805] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101550,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 101551,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[806] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101551,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 101552,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[807] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101552,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 101553,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[808] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101553,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101554,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[809] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101554,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 14,
			},
			[3] = {
				[1] = 4,
				[2] = 28000000,
			},
		},
		product = {
			[1] = {
				[1] = 101555,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[810] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101555,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 16,
			},
			[3] = {
				[1] = 4,
				[2] = 32000000,
			},
		},
		product = {
			[1] = {
				[1] = 101556,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[811] = {
		type = 2,
		page1 = 1,
		page2 = 4,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101556,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 101557,
				[2] = 1,
			},
		},
		name = "头盔",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[812] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101947,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 101948,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[813] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101948,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 101949,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[814] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101949,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 101950,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[815] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101950,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 101951,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[816] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101951,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 16,
			},
			[3] = {
				[1] = 4,
				[2] = 32000000,
			},
		},
		product = {
			[1] = {
				[1] = 101952,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[817] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101952,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 20,
			},
			[3] = {
				[1] = 4,
				[2] = 40000000,
			},
		},
		product = {
			[1] = {
				[1] = 101953,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[818] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101953,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 101954,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[819] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101954,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 28,
			},
			[3] = {
				[1] = 4,
				[2] = 56000000,
			},
		},
		product = {
			[1] = {
				[1] = 101955,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[820] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101955,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 32,
			},
			[3] = {
				[1] = 4,
				[2] = 64000000,
			},
		},
		product = {
			[1] = {
				[1] = 101956,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[821] = {
		type = 2,
		page1 = 1,
		page2 = 5,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 101956,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 36,
			},
			[3] = {
				[1] = 4,
				[2] = 72000000,
			},
		},
		product = {
			[1] = {
				[1] = 101957,
				[2] = 1,
			},
		},
		name = "项链",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[822] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102647,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 102648,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[823] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102648,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 102649,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[824] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102649,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 102650,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[825] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102650,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 102651,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[826] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102651,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 102652,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[827] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102652,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 102653,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[828] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102653,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 102654,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[829] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102654,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 14,
			},
			[3] = {
				[1] = 4,
				[2] = 28000000,
			},
		},
		product = {
			[1] = {
				[1] = 102655,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[830] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102655,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 16,
			},
			[3] = {
				[1] = 4,
				[2] = 32000000,
			},
		},
		product = {
			[1] = {
				[1] = 102656,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[831] = {
		type = 2,
		page1 = 1,
		page2 = 6,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102656,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 102657,
				[2] = 1,
			},
		},
		name = "手镯",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[832] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102247,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 102248,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[833] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102248,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 102249,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[834] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102249,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 102250,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[835] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102250,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 102251,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[836] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102251,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 102252,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[837] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102252,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 30000000,
			},
		},
		product = {
			[1] = {
				[1] = 102253,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[838] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102253,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 102254,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[839] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102254,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 21,
			},
			[3] = {
				[1] = 4,
				[2] = 42000000,
			},
		},
		product = {
			[1] = {
				[1] = 102255,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[840] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102255,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 102256,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[841] = {
		type = 2,
		page1 = 1,
		page2 = 7,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 102256,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 27,
			},
			[3] = {
				[1] = 4,
				[2] = 54000000,
			},
		},
		product = {
			[1] = {
				[1] = 102257,
				[2] = 1,
			},
		},
		name = "戒指[麻痹]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[842] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112247,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 112248,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[843] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112248,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 3,
			},
			[3] = {
				[1] = 4,
				[2] = 6000000,
			},
		},
		product = {
			[1] = {
				[1] = 112249,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[844] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112249,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 112250,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[845] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112250,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 9,
			},
			[3] = {
				[1] = 4,
				[2] = 18000000,
			},
		},
		product = {
			[1] = {
				[1] = 112251,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[846] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112251,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 112252,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[847] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112252,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 15,
			},
			[3] = {
				[1] = 4,
				[2] = 30000000,
			},
		},
		product = {
			[1] = {
				[1] = 112253,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[848] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112253,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 112254,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[849] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112254,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 21,
			},
			[3] = {
				[1] = 4,
				[2] = 42000000,
			},
		},
		product = {
			[1] = {
				[1] = 112255,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[850] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112255,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 24,
			},
			[3] = {
				[1] = 4,
				[2] = 48000000,
			},
		},
		product = {
			[1] = {
				[1] = 112256,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[851] = {
		type = 2,
		page1 = 1,
		page2 = 8,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 112256,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 27,
			},
			[3] = {
				[1] = 4,
				[2] = 54000000,
			},
		},
		product = {
			[1] = {
				[1] = 112257,
				[2] = 1,
			},
		},
		name = "戒指[复活]",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[852] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105447,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 105448,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[853] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105448,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 105449,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[854] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105449,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 105450,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[855] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105450,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 105451,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[856] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105451,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 105452,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[857] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105452,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 105453,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[858] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105453,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 105454,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[859] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105454,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 14,
			},
			[3] = {
				[1] = 4,
				[2] = 28000000,
			},
		},
		product = {
			[1] = {
				[1] = 105455,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[860] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105455,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 16,
			},
			[3] = {
				[1] = 4,
				[2] = 32000000,
			},
		},
		product = {
			[1] = {
				[1] = 105456,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[861] = {
		type = 2,
		page1 = 1,
		page2 = 9,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105456,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 105457,
				[2] = 1,
			},
		},
		name = "腰带",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[862] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 1,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105247,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 105248,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 2000,
		npcid = 262,
	},
	[863] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 2,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105248,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 2,
			},
			[3] = {
				[1] = 4,
				[2] = 4000000,
			},
		},
		product = {
			[1] = {
				[1] = 105249,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[864] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 3,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105249,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 4,
			},
			[3] = {
				[1] = 4,
				[2] = 8000000,
			},
		},
		product = {
			[1] = {
				[1] = 105250,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[865] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 4,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105250,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 6,
			},
			[3] = {
				[1] = 4,
				[2] = 12000000,
			},
		},
		product = {
			[1] = {
				[1] = 105251,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[866] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 5,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105251,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 8,
			},
			[3] = {
				[1] = 4,
				[2] = 16000000,
			},
		},
		product = {
			[1] = {
				[1] = 105252,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[867] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 6,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105252,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 10,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 105253,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[868] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 7,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105253,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 12,
			},
			[3] = {
				[1] = 4,
				[2] = 24000000,
			},
		},
		product = {
			[1] = {
				[1] = 105254,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[869] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 8,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105254,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 14,
			},
			[3] = {
				[1] = 4,
				[2] = 28000000,
			},
		},
		product = {
			[1] = {
				[1] = 105255,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[870] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 9,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105255,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 16,
			},
			[3] = {
				[1] = 4,
				[2] = 32000000,
			},
		},
		product = {
			[1] = {
				[1] = 105256,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[871] = {
		type = 2,
		page1 = 1,
		page2 = 10,
		condition = 10001,
		page3 = 10,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 105256,
				[2] = 1,
			},
			[2] = {
				[1] = 7340308,
				[2] = 18,
			},
			[3] = {
				[1] = 4,
				[2] = 36000000,
			},
		},
		product = {
			[1] = {
				[1] = 105257,
				[2] = 1,
			},
		},
		name = "靴子",
		name2 = "弑神套装",
		probability = 5000,
		npcid = 262,
	},
	[872] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100901,
				[2] = 1,
			},
			[2] = {
				[1] = 9200901,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300954,
				[2] = 1,
			},
		},
		name2 = "昆仑镜",
		probability = 10000,
		npcid = 258,
	},
	[873] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100902,
				[2] = 1,
			},
			[2] = {
				[1] = 9200902,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300955,
				[2] = 1,
			},
		},
		name2 = "诛仙剑",
		probability = 10000,
		npcid = 258,
	},
	[874] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100903,
				[2] = 1,
			},
			[2] = {
				[1] = 9200903,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300956,
				[2] = 1,
			},
		},
		name2 = "照妖镜",
		probability = 10000,
		npcid = 258,
	},
	[875] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100904,
				[2] = 1,
			},
			[2] = {
				[1] = 9200904,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 5000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300957,
				[2] = 1,
			},
		},
		name2 = "琉璃瓶",
		probability = 10000,
		npcid = 258,
	},
	[876] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100905,
				[2] = 1,
			},
			[2] = {
				[1] = 9200905,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300958,
				[2] = 1,
			},
		},
		name2 = "伏羲琴",
		probability = 10000,
		npcid = 258,
	},
	[877] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100906,
				[2] = 1,
			},
			[2] = {
				[1] = 9200906,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300959,
				[2] = 1,
			},
		},
		name2 = "功德笔",
		probability = 10000,
		npcid = 258,
	},
	[878] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100907,
				[2] = 1,
			},
			[2] = {
				[1] = 9200907,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300960,
				[2] = 1,
			},
		},
		name2 = "锁妖塔",
		probability = 10000,
		npcid = 258,
	},
	[879] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100908,
				[2] = 1,
			},
			[2] = {
				[1] = 9200908,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 10000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300961,
				[2] = 1,
			},
		},
		name2 = "乾坤鼎",
		probability = 10000,
		npcid = 258,
	},
	[880] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100909,
				[2] = 1,
			},
			[2] = {
				[1] = 9200909,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300962,
				[2] = 1,
			},
		},
		name2 = "净世莲",
		probability = 10000,
		npcid = 258,
	},
	[881] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100910,
				[2] = 1,
			},
			[2] = {
				[1] = 9200910,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300963,
				[2] = 1,
			},
		},
		name2 = "定风珠",
		probability = 10000,
		npcid = 258,
	},
	[882] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100911,
				[2] = 1,
			},
			[2] = {
				[1] = 9200911,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300964,
				[2] = 1,
			},
		},
		name2 = "金葫芦",
		probability = 10000,
		npcid = 258,
	},
	[883] = {
		type = 3,
		page1 = 1,
		condition = 10001,
		condition2 = 10001,
		itemid1 = {
			[1] = {
				[1] = 9100912,
				[2] = 1,
			},
			[2] = {
				[1] = 9200912,
				[2] = 1,
			},
			[3] = {
				[1] = 4,
				[2] = 20000000,
			},
		},
		product = {
			[1] = {
				[1] = 9300965,
				[2] = 1,
			},
		},
		name2 = "禁神珠",
		probability = 10000,
		npcid = 258,
	},
}
return config