local config = {
	[1] = {
		name = "狂暴之力",
		cost = {
			[1] = {
				[1] = 7,
				[2] = 5000,
			},
		},
		shuxing = {
			[1] = {
				[1] = 65,
				[2] = 2000,
			},
			[2] = {
				[1] = 75,
				[2] = 1000,
			},
			[3] = {
				[1] = 30,
				[2] = 100,
			},
		},
		diaoluo = {
			[1] = {
				[1] = 7,
				[2] = 2500,
			},
		},
		shijian = {
			[1] = {
				[1] = 23,
				[2] = 8,
			},
		},
		mapid = {
			[1] = {
				[1] = "dld",
				[2] = "yiyu",
				[3] = 3,
			},
		},
		desce = "花费5000灵符可以激活狂暴之力！\n<br><font color='#4AE74A'>打怪爆率 + 20%\n</font><br><font color='#4AE74A'>对怪伤害 + 10%\n</font><br><font color='#4AE74A'>生命上限 + 100%\n</font><br>被玩家击杀后状态消失\n<br>击杀者可获得2500灵符奖励！\n<br>晚上11点-早上8点被击杀不掉狂暴！",
	},
}
return config