local config = {
	[1] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[2] = {
		activityid = 21000,
		index = 2,
		recharge = 20001,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[3] = {
		activityid = 21000,
		index = 3,
		recharge = 20002,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[4] = {
		activityid = 21000,
		index = 4,
		recharge = 20003,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[5] = {
		activityid = 21000,
		index = 5,
		recharge = 20004,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[6] = {
		activityid = 21000,
		index = 6,
		recharge = 20005,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[7] = {
		activityid = 21000,
		index = 7,
		recharge = 20006,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[8] = {
		activityid = 21000,
		index = 8,
		recharge = 20007,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[9] = {
		activityid = 21000,
		index = 9,
		recharge = 20008,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[10] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[11] = {
		activityid = 21000,
		index = 2,
		recharge = 20009,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[12] = {
		activityid = 21000,
		index = 3,
		recharge = 20010,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[13] = {
		activityid = 21000,
		index = 4,
		recharge = 20011,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[14] = {
		activityid = 21000,
		index = 5,
		recharge = 20012,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[15] = {
		activityid = 21000,
		index = 6,
		recharge = 20013,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[16] = {
		activityid = 21000,
		index = 7,
		recharge = 20014,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[17] = {
		activityid = 21000,
		index = 8,
		recharge = 20015,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[18] = {
		activityid = 21000,
		index = 9,
		recharge = 20016,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[19] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[20] = {
		activityid = 21000,
		index = 2,
		recharge = 20017,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[21] = {
		activityid = 21000,
		index = 3,
		recharge = 20018,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[22] = {
		activityid = 21000,
		index = 4,
		recharge = 20019,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[23] = {
		activityid = 21000,
		index = 5,
		recharge = 20020,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[24] = {
		activityid = 21000,
		index = 6,
		recharge = 20021,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[25] = {
		activityid = 21000,
		index = 7,
		recharge = 20022,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[26] = {
		activityid = 21000,
		index = 8,
		recharge = 20023,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[27] = {
		activityid = 21000,
		index = 9,
		recharge = 20024,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[28] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[29] = {
		activityid = 21000,
		index = 2,
		recharge = 20025,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[30] = {
		activityid = 21000,
		index = 3,
		recharge = 20026,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[31] = {
		activityid = 21000,
		index = 4,
		recharge = 20027,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[32] = {
		activityid = 21000,
		index = 5,
		recharge = 20028,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[33] = {
		activityid = 21000,
		index = 6,
		recharge = 20029,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[34] = {
		activityid = 21000,
		index = 7,
		recharge = 20030,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[35] = {
		activityid = 21000,
		index = 8,
		recharge = 20031,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[36] = {
		activityid = 21000,
		index = 9,
		recharge = 20032,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[37] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[38] = {
		activityid = 21000,
		index = 2,
		recharge = 20033,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[39] = {
		activityid = 21000,
		index = 3,
		recharge = 20034,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[40] = {
		activityid = 21000,
		index = 4,
		recharge = 20035,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[41] = {
		activityid = 21000,
		index = 5,
		recharge = 20036,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[42] = {
		activityid = 21000,
		index = 6,
		recharge = 20037,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[43] = {
		activityid = 21000,
		index = 7,
		recharge = 20038,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[44] = {
		activityid = 21000,
		index = 8,
		recharge = 20039,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[45] = {
		activityid = 21000,
		index = 9,
		recharge = 20040,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[46] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[47] = {
		activityid = 21000,
		index = 2,
		recharge = 20041,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[48] = {
		activityid = 21000,
		index = 3,
		recharge = 20042,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[49] = {
		activityid = 21000,
		index = 4,
		recharge = 20043,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[50] = {
		activityid = 21000,
		index = 5,
		recharge = 20044,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[51] = {
		activityid = 21000,
		index = 6,
		recharge = 20045,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[52] = {
		activityid = 21000,
		index = 7,
		recharge = 20046,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[53] = {
		activityid = 21000,
		index = 8,
		recharge = 20047,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[54] = {
		activityid = 21000,
		index = 9,
		recharge = 20048,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[55] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[56] = {
		activityid = 21000,
		index = 2,
		recharge = 20049,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[57] = {
		activityid = 21000,
		index = 3,
		recharge = 20050,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[58] = {
		activityid = 21000,
		index = 4,
		recharge = 20051,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[59] = {
		activityid = 21000,
		index = 5,
		recharge = 20052,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[60] = {
		activityid = 21000,
		index = 6,
		recharge = 20053,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[61] = {
		activityid = 21000,
		index = 7,
		recharge = 20054,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[62] = {
		activityid = 21000,
		index = 8,
		recharge = 20055,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[63] = {
		activityid = 21000,
		index = 9,
		recharge = 20056,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[64] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[65] = {
		activityid = 21000,
		index = 2,
		recharge = 20057,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[66] = {
		activityid = 21000,
		index = 3,
		recharge = 20058,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[67] = {
		activityid = 21000,
		index = 4,
		recharge = 20059,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[68] = {
		activityid = 21000,
		index = 5,
		recharge = 20060,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[69] = {
		activityid = 21000,
		index = 6,
		recharge = 20061,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[70] = {
		activityid = 21000,
		index = 7,
		recharge = 20062,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[71] = {
		activityid = 21000,
		index = 8,
		recharge = 20063,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[72] = {
		activityid = 21000,
		index = 9,
		recharge = 20064,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[73] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[74] = {
		activityid = 21000,
		index = 2,
		recharge = 20065,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[75] = {
		activityid = 21000,
		index = 3,
		recharge = 20066,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[76] = {
		activityid = 21000,
		index = 4,
		recharge = 20067,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[77] = {
		activityid = 21000,
		index = 5,
		recharge = 20068,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[78] = {
		activityid = 21000,
		index = 6,
		recharge = 20069,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[79] = {
		activityid = 21000,
		index = 7,
		recharge = 20070,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[80] = {
		activityid = 21000,
		index = 8,
		recharge = 20071,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[81] = {
		activityid = 21000,
		index = 9,
		recharge = 20072,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[82] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[83] = {
		activityid = 21000,
		index = 2,
		recharge = 20073,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[84] = {
		activityid = 21000,
		index = 3,
		recharge = 20074,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[85] = {
		activityid = 21000,
		index = 4,
		recharge = 20075,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[86] = {
		activityid = 21000,
		index = 5,
		recharge = 20076,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[87] = {
		activityid = 21000,
		index = 6,
		recharge = 20077,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[88] = {
		activityid = 21000,
		index = 7,
		recharge = 20078,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[89] = {
		activityid = 21000,
		index = 8,
		recharge = 20079,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[90] = {
		activityid = 21000,
		index = 9,
		recharge = 20080,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[91] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[92] = {
		activityid = 21000,
		index = 2,
		recharge = 20081,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[93] = {
		activityid = 21000,
		index = 3,
		recharge = 20082,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[94] = {
		activityid = 21000,
		index = 4,
		recharge = 20083,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[95] = {
		activityid = 21000,
		index = 5,
		recharge = 20084,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[96] = {
		activityid = 21000,
		index = 6,
		recharge = 20085,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[97] = {
		activityid = 21000,
		index = 7,
		recharge = 20086,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[98] = {
		activityid = 21000,
		index = 8,
		recharge = 20087,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[99] = {
		activityid = 21000,
		index = 9,
		recharge = 20088,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[100] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[101] = {
		activityid = 21000,
		index = 2,
		recharge = 20089,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[102] = {
		activityid = 21000,
		index = 3,
		recharge = 20090,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[103] = {
		activityid = 21000,
		index = 4,
		recharge = 20091,
		name = "298元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 298,
		zkbuy = 298,
		limit = 1,
		announce = 10228,
		 = "298元直购礼包",
	},
	[104] = {
		activityid = 21000,
		index = 5,
		recharge = 20092,
		name = "998元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 998,
		zkbuy = 998,
		limit = 1,
		announce = 10228,
		 = "998元直购礼包",
	},
	[105] = {
		activityid = 21000,
		index = 6,
		recharge = 20093,
		name = "98元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[106] = {
		activityid = 21000,
		index = 7,
		recharge = 20094,
		name = "300元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[107] = {
		activityid = 21000,
		index = 8,
		recharge = 20095,
		name = "500元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[108] = {
		activityid = 21000,
		index = 9,
		recharge = 20096,
		name = "1000元直购礼包",
		showcondition = 10999,
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[109] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[110] = {
		activityid = 21000,
		index = 2,
		recharge = 20097,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[111] = {
		activityid = 21000,
		index = 3,
		recharge = 20098,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[112] = {
		activityid = 21000,
		index = 4,
		recharge = 20099,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[113] = {
		activityid = 21000,
		index = 5,
		recharge = 20100,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[114] = {
		activityid = 21000,
		index = 6,
		recharge = 20101,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[115] = {
		activityid = 21000,
		index = 7,
		recharge = 20102,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[116] = {
		activityid = 21000,
		index = 8,
		recharge = 20103,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[117] = {
		activityid = 21000,
		index = 9,
		recharge = 20104,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[118] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[119] = {
		activityid = 21000,
		index = 2,
		recharge = 20105,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[120] = {
		activityid = 21000,
		index = 3,
		recharge = 20106,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[121] = {
		activityid = 21000,
		index = 4,
		recharge = 20107,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[122] = {
		activityid = 21000,
		index = 5,
		recharge = 20108,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[123] = {
		activityid = 21000,
		index = 6,
		recharge = 20109,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[124] = {
		activityid = 21000,
		index = 7,
		recharge = 20110,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[125] = {
		activityid = 21000,
		index = 8,
		recharge = 20111,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[126] = {
		activityid = 21000,
		index = 9,
		recharge = 20112,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[127] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[128] = {
		activityid = 21000,
		index = 2,
		recharge = 20113,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[129] = {
		activityid = 21000,
		index = 3,
		recharge = 20114,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[130] = {
		activityid = 21000,
		index = 4,
		recharge = 20115,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[131] = {
		activityid = 21000,
		index = 5,
		recharge = 20116,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[132] = {
		activityid = 21000,
		index = 6,
		recharge = 20117,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[133] = {
		activityid = 21000,
		index = 7,
		recharge = 20118,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[134] = {
		activityid = 21000,
		index = 8,
		recharge = 20119,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[135] = {
		activityid = 21000,
		index = 9,
		recharge = 20120,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[136] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[137] = {
		activityid = 21000,
		index = 2,
		recharge = 20121,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[138] = {
		activityid = 21000,
		index = 3,
		recharge = 20122,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[139] = {
		activityid = 21000,
		index = 4,
		recharge = 20123,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[140] = {
		activityid = 21000,
		index = 5,
		recharge = 20124,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[141] = {
		activityid = 21000,
		index = 6,
		recharge = 20125,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[142] = {
		activityid = 21000,
		index = 7,
		recharge = 20126,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[143] = {
		activityid = 21000,
		index = 8,
		recharge = 20127,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[144] = {
		activityid = 21000,
		index = 9,
		recharge = 20128,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[145] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[146] = {
		activityid = 21000,
		index = 2,
		recharge = 20129,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[147] = {
		activityid = 21000,
		index = 3,
		recharge = 20130,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[148] = {
		activityid = 21000,
		index = 4,
		recharge = 20131,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[149] = {
		activityid = 21000,
		index = 5,
		recharge = 20132,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[150] = {
		activityid = 21000,
		index = 6,
		recharge = 20133,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[151] = {
		activityid = 21000,
		index = 7,
		recharge = 20134,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[152] = {
		activityid = 21000,
		index = 8,
		recharge = 20135,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[153] = {
		activityid = 21000,
		index = 9,
		recharge = 20136,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[154] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[155] = {
		activityid = 21000,
		index = 2,
		recharge = 20137,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[156] = {
		activityid = 21000,
		index = 3,
		recharge = 20138,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[157] = {
		activityid = 21000,
		index = 4,
		recharge = 20139,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[158] = {
		activityid = 21000,
		index = 5,
		recharge = 20140,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[159] = {
		activityid = 21000,
		index = 6,
		recharge = 20141,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[160] = {
		activityid = 21000,
		index = 7,
		recharge = 20142,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[161] = {
		activityid = 21000,
		index = 8,
		recharge = 20143,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[162] = {
		activityid = 21000,
		index = 9,
		recharge = 20144,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[163] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[164] = {
		activityid = 21000,
		index = 2,
		recharge = 20145,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[165] = {
		activityid = 21000,
		index = 3,
		recharge = 20146,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[166] = {
		activityid = 21000,
		index = 4,
		recharge = 20147,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[167] = {
		activityid = 21000,
		index = 5,
		recharge = 20148,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[168] = {
		activityid = 21000,
		index = 6,
		recharge = 20149,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[169] = {
		activityid = 21000,
		index = 7,
		recharge = 20150,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[170] = {
		activityid = 21000,
		index = 8,
		recharge = 20151,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[171] = {
		activityid = 21000,
		index = 9,
		recharge = 20152,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[172] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[173] = {
		activityid = 21000,
		index = 2,
		recharge = 20153,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[174] = {
		activityid = 21000,
		index = 3,
		recharge = 20154,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[175] = {
		activityid = 21000,
		index = 4,
		recharge = 20155,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[176] = {
		activityid = 21000,
		index = 5,
		recharge = 20156,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[177] = {
		activityid = 21000,
		index = 6,
		recharge = 20157,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[178] = {
		activityid = 21000,
		index = 7,
		recharge = 20158,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[179] = {
		activityid = 21000,
		index = 8,
		recharge = 20159,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[180] = {
		activityid = 21000,
		index = 9,
		recharge = 20160,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[181] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[182] = {
		activityid = 21000,
		index = 2,
		recharge = 20161,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[183] = {
		activityid = 21000,
		index = 3,
		recharge = 20162,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[184] = {
		activityid = 21000,
		index = 4,
		recharge = 20163,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[185] = {
		activityid = 21000,
		index = 5,
		recharge = 20164,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[186] = {
		activityid = 21000,
		index = 6,
		recharge = 20165,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[187] = {
		activityid = 21000,
		index = 7,
		recharge = 20166,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[188] = {
		activityid = 21000,
		index = 8,
		recharge = 20167,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[189] = {
		activityid = 21000,
		index = 9,
		recharge = 20168,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[190] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[191] = {
		activityid = 21000,
		index = 2,
		recharge = 20169,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[192] = {
		activityid = 21000,
		index = 3,
		recharge = 20170,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[193] = {
		activityid = 21000,
		index = 4,
		recharge = 20171,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[194] = {
		activityid = 21000,
		index = 5,
		recharge = 20172,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[195] = {
		activityid = 21000,
		index = 6,
		recharge = 20173,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[196] = {
		activityid = 21000,
		index = 7,
		recharge = 20174,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[197] = {
		activityid = 21000,
		index = 8,
		recharge = 20175,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[198] = {
		activityid = 21000,
		index = 9,
		recharge = 20176,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[199] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[200] = {
		activityid = 21000,
		index = 2,
		recharge = 20177,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[201] = {
		activityid = 21000,
		index = 3,
		recharge = 20178,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[202] = {
		activityid = 21000,
		index = 4,
		recharge = 20179,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[203] = {
		activityid = 21000,
		index = 5,
		recharge = 20180,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[204] = {
		activityid = 21000,
		index = 6,
		recharge = 20181,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[205] = {
		activityid = 21000,
		index = 7,
		recharge = 20182,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[206] = {
		activityid = 21000,
		index = 8,
		recharge = 20183,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[207] = {
		activityid = 21000,
		index = 9,
		recharge = 20184,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[208] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[209] = {
		activityid = 21000,
		index = 2,
		recharge = 20185,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[210] = {
		activityid = 21000,
		index = 3,
		recharge = 20186,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[211] = {
		activityid = 21000,
		index = 4,
		recharge = 20187,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[212] = {
		activityid = 21000,
		index = 5,
		recharge = 20188,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[213] = {
		activityid = 21000,
		index = 6,
		recharge = 20189,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[214] = {
		activityid = 21000,
		index = 7,
		recharge = 20190,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[215] = {
		activityid = 21000,
		index = 8,
		recharge = 20191,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[216] = {
		activityid = 21000,
		index = 9,
		recharge = 20192,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[217] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 80,
				[2] = 20,
			},
			[2] = {
				[1] = 3000922,
				[2] = 1,
			},
			[3] = {
				[1] = 41,
				[2] = 50000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[218] = {
		activityid = 21000,
		index = 2,
		recharge = 20193,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3025677,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 5,
			},
			[3] = {
				[1] = 41,
				[2] = 200000,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[219] = {
		activityid = 21000,
		index = 3,
		recharge = 20194,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3025687,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 10,
			},
			[3] = {
				[1] = 41,
				[2] = 500000,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[220] = {
		activityid = 21000,
		index = 4,
		recharge = 20195,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3025707,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 20,
			},
			[3] = {
				[1] = 41,
				[2] = 1000000,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[221] = {
		activityid = 21000,
		index = 5,
		recharge = 20196,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3025837,
				[2] = 1,
			},
			[2] = {
				[1] = 81,
				[2] = 50,
			},
			[3] = {
				[1] = 41,
				[2] = 2000000,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[222] = {
		activityid = 21000,
		index = 6,
		recharge = 20197,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[223] = {
		activityid = 21000,
		index = 7,
		recharge = 20198,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[224] = {
		activityid = 21000,
		index = 8,
		recharge = 20199,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[225] = {
		activityid = 21000,
		index = 9,
		recharge = 20200,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[226] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[227] = {
		activityid = 21000,
		index = 2,
		recharge = 20201,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[228] = {
		activityid = 21000,
		index = 3,
		recharge = 20202,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[229] = {
		activityid = 21000,
		index = 4,
		recharge = 20203,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[230] = {
		activityid = 21000,
		index = 5,
		recharge = 20204,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[231] = {
		activityid = 21000,
		index = 6,
		recharge = 20205,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[232] = {
		activityid = 21000,
		index = 7,
		recharge = 20206,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[233] = {
		activityid = 21000,
		index = 8,
		recharge = 20207,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[234] = {
		activityid = 21000,
		index = 9,
		recharge = 20208,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[235] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[236] = {
		activityid = 21000,
		index = 2,
		recharge = 20209,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[237] = {
		activityid = 21000,
		index = 3,
		recharge = 20210,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[238] = {
		activityid = 21000,
		index = 4,
		recharge = 20211,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[239] = {
		activityid = 21000,
		index = 5,
		recharge = 20212,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[240] = {
		activityid = 21000,
		index = 6,
		recharge = 20213,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[241] = {
		activityid = 21000,
		index = 7,
		recharge = 20214,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[242] = {
		activityid = 21000,
		index = 8,
		recharge = 20215,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[243] = {
		activityid = 21000,
		index = 9,
		recharge = 20216,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[244] = {
		activityid = 21000,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[245] = {
		activityid = 21000,
		index = 2,
		recharge = 20217,
		name = "10元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[246] = {
		activityid = 21000,
		index = 3,
		recharge = 20218,
		name = "18元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[247] = {
		activityid = 21000,
		index = 4,
		recharge = 20219,
		name = "28元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[248] = {
		activityid = 21000,
		index = 5,
		recharge = 20220,
		name = "48元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[249] = {
		activityid = 21000,
		index = 6,
		recharge = 20221,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[250] = {
		activityid = 21000,
		index = 7,
		recharge = 20222,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[251] = {
		activityid = 21000,
		index = 8,
		recharge = 20223,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[252] = {
		activityid = 21000,
		index = 9,
		recharge = 20224,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[253] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[254] = {
		activityid = 21001,
		index = 2,
		recharge = 20001,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[255] = {
		activityid = 21001,
		index = 3,
		recharge = 20002,
		name = "18元直购礼包",
		showcondition = {
			[1] = 1020010,
			[2] = 90002,
			[3] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[256] = {
		activityid = 21001,
		index = 4,
		recharge = 20003,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[257] = {
		activityid = 21001,
		index = 5,
		recharge = 20004,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[258] = {
		activityid = 21001,
		index = 6,
		recharge = 20005,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[259] = {
		activityid = 21001,
		index = 7,
		recharge = 20006,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[260] = {
		activityid = 21001,
		index = 8,
		recharge = 20007,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[261] = {
		activityid = 21001,
		index = 9,
		recharge = 20008,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90002,
			[2] = 100002,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[262] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[263] = {
		activityid = 21001,
		index = 2,
		recharge = 20009,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[264] = {
		activityid = 21001,
		index = 3,
		recharge = 20010,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[265] = {
		activityid = 21001,
		index = 4,
		recharge = 20011,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[266] = {
		activityid = 21001,
		index = 5,
		recharge = 20012,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[267] = {
		activityid = 21001,
		index = 6,
		recharge = 20013,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[268] = {
		activityid = 21001,
		index = 7,
		recharge = 20014,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[269] = {
		activityid = 21001,
		index = 8,
		recharge = 20015,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[270] = {
		activityid = 21001,
		index = 9,
		recharge = 20016,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90003,
			[2] = 100003,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[271] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[272] = {
		activityid = 21001,
		index = 2,
		recharge = 20017,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[273] = {
		activityid = 21001,
		index = 3,
		recharge = 20018,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[274] = {
		activityid = 21001,
		index = 4,
		recharge = 20019,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[275] = {
		activityid = 21001,
		index = 5,
		recharge = 20020,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[276] = {
		activityid = 21001,
		index = 6,
		recharge = 20021,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[277] = {
		activityid = 21001,
		index = 7,
		recharge = 20022,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[278] = {
		activityid = 21001,
		index = 8,
		recharge = 20023,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[279] = {
		activityid = 21001,
		index = 9,
		recharge = 20024,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90004,
			[2] = 100004,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[280] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[281] = {
		activityid = 21001,
		index = 2,
		recharge = 20025,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[282] = {
		activityid = 21001,
		index = 3,
		recharge = 20026,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[283] = {
		activityid = 21001,
		index = 4,
		recharge = 20027,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[284] = {
		activityid = 21001,
		index = 5,
		recharge = 20028,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[285] = {
		activityid = 21001,
		index = 6,
		recharge = 20029,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[286] = {
		activityid = 21001,
		index = 7,
		recharge = 20030,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[287] = {
		activityid = 21001,
		index = 8,
		recharge = 20031,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[288] = {
		activityid = 21001,
		index = 9,
		recharge = 20032,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90005,
			[2] = 100005,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[289] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[290] = {
		activityid = 21001,
		index = 2,
		recharge = 20033,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[291] = {
		activityid = 21001,
		index = 3,
		recharge = 20034,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[292] = {
		activityid = 21001,
		index = 4,
		recharge = 20035,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[293] = {
		activityid = 21001,
		index = 5,
		recharge = 20036,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[294] = {
		activityid = 21001,
		index = 6,
		recharge = 20037,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[295] = {
		activityid = 21001,
		index = 7,
		recharge = 20038,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[296] = {
		activityid = 21001,
		index = 8,
		recharge = 20039,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[297] = {
		activityid = 21001,
		index = 9,
		recharge = 20040,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90006,
			[2] = 100006,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[298] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[299] = {
		activityid = 21001,
		index = 2,
		recharge = 20041,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[300] = {
		activityid = 21001,
		index = 3,
		recharge = 20042,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[301] = {
		activityid = 21001,
		index = 4,
		recharge = 20043,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[302] = {
		activityid = 21001,
		index = 5,
		recharge = 20044,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[303] = {
		activityid = 21001,
		index = 6,
		recharge = 20045,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[304] = {
		activityid = 21001,
		index = 7,
		recharge = 20046,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[305] = {
		activityid = 21001,
		index = 8,
		recharge = 20047,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[306] = {
		activityid = 21001,
		index = 9,
		recharge = 20048,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90007,
			[2] = 100007,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[307] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[308] = {
		activityid = 21001,
		index = 2,
		recharge = 20049,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[309] = {
		activityid = 21001,
		index = 3,
		recharge = 20050,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[310] = {
		activityid = 21001,
		index = 4,
		recharge = 20051,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[311] = {
		activityid = 21001,
		index = 5,
		recharge = 20052,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[312] = {
		activityid = 21001,
		index = 6,
		recharge = 20053,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[313] = {
		activityid = 21001,
		index = 7,
		recharge = 20054,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[314] = {
		activityid = 21001,
		index = 8,
		recharge = 20055,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[315] = {
		activityid = 21001,
		index = 9,
		recharge = 20056,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90008,
			[2] = 100008,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[316] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[317] = {
		activityid = 21001,
		index = 2,
		recharge = 20057,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[318] = {
		activityid = 21001,
		index = 3,
		recharge = 20058,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[319] = {
		activityid = 21001,
		index = 4,
		recharge = 20059,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[320] = {
		activityid = 21001,
		index = 5,
		recharge = 20060,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[321] = {
		activityid = 21001,
		index = 6,
		recharge = 20061,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[322] = {
		activityid = 21001,
		index = 7,
		recharge = 20062,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[323] = {
		activityid = 21001,
		index = 8,
		recharge = 20063,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[324] = {
		activityid = 21001,
		index = 9,
		recharge = 20064,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90009,
			[2] = 100009,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[325] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[326] = {
		activityid = 21001,
		index = 2,
		recharge = 20065,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[327] = {
		activityid = 21001,
		index = 3,
		recharge = 20066,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[328] = {
		activityid = 21001,
		index = 4,
		recharge = 20067,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[329] = {
		activityid = 21001,
		index = 5,
		recharge = 20068,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[330] = {
		activityid = 21001,
		index = 6,
		recharge = 20069,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[331] = {
		activityid = 21001,
		index = 7,
		recharge = 20070,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[332] = {
		activityid = 21001,
		index = 8,
		recharge = 20071,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[333] = {
		activityid = 21001,
		index = 9,
		recharge = 20072,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90010,
			[2] = 100010,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[334] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[335] = {
		activityid = 21001,
		index = 2,
		recharge = 20073,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[336] = {
		activityid = 21001,
		index = 3,
		recharge = 20074,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[337] = {
		activityid = 21001,
		index = 4,
		recharge = 20075,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[338] = {
		activityid = 21001,
		index = 5,
		recharge = 20076,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[339] = {
		activityid = 21001,
		index = 6,
		recharge = 20077,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[340] = {
		activityid = 21001,
		index = 7,
		recharge = 20078,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[341] = {
		activityid = 21001,
		index = 8,
		recharge = 20079,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[342] = {
		activityid = 21001,
		index = 9,
		recharge = 20080,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90011,
			[2] = 100011,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[343] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[344] = {
		activityid = 21001,
		index = 2,
		recharge = 20081,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[345] = {
		activityid = 21001,
		index = 3,
		recharge = 20082,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[346] = {
		activityid = 21001,
		index = 4,
		recharge = 20083,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[347] = {
		activityid = 21001,
		index = 5,
		recharge = 20084,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[348] = {
		activityid = 21001,
		index = 6,
		recharge = 20085,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[349] = {
		activityid = 21001,
		index = 7,
		recharge = 20086,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[350] = {
		activityid = 21001,
		index = 8,
		recharge = 20087,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[351] = {
		activityid = 21001,
		index = 9,
		recharge = 20088,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90012,
			[2] = 100012,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[352] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[353] = {
		activityid = 21001,
		index = 2,
		recharge = 20089,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[354] = {
		activityid = 21001,
		index = 3,
		recharge = 20090,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[355] = {
		activityid = 21001,
		index = 4,
		recharge = 20091,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[356] = {
		activityid = 21001,
		index = 5,
		recharge = 20092,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[357] = {
		activityid = 21001,
		index = 6,
		recharge = 20093,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[358] = {
		activityid = 21001,
		index = 7,
		recharge = 20094,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[359] = {
		activityid = 21001,
		index = 8,
		recharge = 20095,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[360] = {
		activityid = 21001,
		index = 9,
		recharge = 20096,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90013,
			[2] = 100013,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[361] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[362] = {
		activityid = 21001,
		index = 2,
		recharge = 20097,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[363] = {
		activityid = 21001,
		index = 3,
		recharge = 20098,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[364] = {
		activityid = 21001,
		index = 4,
		recharge = 20099,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[365] = {
		activityid = 21001,
		index = 5,
		recharge = 20100,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[366] = {
		activityid = 21001,
		index = 6,
		recharge = 20101,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[367] = {
		activityid = 21001,
		index = 7,
		recharge = 20102,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[368] = {
		activityid = 21001,
		index = 8,
		recharge = 20103,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[369] = {
		activityid = 21001,
		index = 9,
		recharge = 20104,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90014,
			[2] = 100014,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[370] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[371] = {
		activityid = 21001,
		index = 2,
		recharge = 20105,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[372] = {
		activityid = 21001,
		index = 3,
		recharge = 20106,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[373] = {
		activityid = 21001,
		index = 4,
		recharge = 20107,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[374] = {
		activityid = 21001,
		index = 5,
		recharge = 20108,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[375] = {
		activityid = 21001,
		index = 6,
		recharge = 20109,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[376] = {
		activityid = 21001,
		index = 7,
		recharge = 20110,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[377] = {
		activityid = 21001,
		index = 8,
		recharge = 20111,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[378] = {
		activityid = 21001,
		index = 9,
		recharge = 20112,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90015,
			[2] = 100015,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[379] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[380] = {
		activityid = 21001,
		index = 2,
		recharge = 20113,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[381] = {
		activityid = 21001,
		index = 3,
		recharge = 20114,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[382] = {
		activityid = 21001,
		index = 4,
		recharge = 20115,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[383] = {
		activityid = 21001,
		index = 5,
		recharge = 20116,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[384] = {
		activityid = 21001,
		index = 6,
		recharge = 20117,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[385] = {
		activityid = 21001,
		index = 7,
		recharge = 20118,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[386] = {
		activityid = 21001,
		index = 8,
		recharge = 20119,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[387] = {
		activityid = 21001,
		index = 9,
		recharge = 20120,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90016,
			[2] = 100016,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[388] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[389] = {
		activityid = 21001,
		index = 2,
		recharge = 20121,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[390] = {
		activityid = 21001,
		index = 3,
		recharge = 20122,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[391] = {
		activityid = 21001,
		index = 4,
		recharge = 20123,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[392] = {
		activityid = 21001,
		index = 5,
		recharge = 20124,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[393] = {
		activityid = 21001,
		index = 6,
		recharge = 20125,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[394] = {
		activityid = 21001,
		index = 7,
		recharge = 20126,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[395] = {
		activityid = 21001,
		index = 8,
		recharge = 20127,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[396] = {
		activityid = 21001,
		index = 9,
		recharge = 20128,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90017,
			[2] = 100017,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[397] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[398] = {
		activityid = 21001,
		index = 2,
		recharge = 20129,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[399] = {
		activityid = 21001,
		index = 3,
		recharge = 20130,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[400] = {
		activityid = 21001,
		index = 4,
		recharge = 20131,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[401] = {
		activityid = 21001,
		index = 5,
		recharge = 20132,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[402] = {
		activityid = 21001,
		index = 6,
		recharge = 20133,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[403] = {
		activityid = 21001,
		index = 7,
		recharge = 20134,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[404] = {
		activityid = 21001,
		index = 8,
		recharge = 20135,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[405] = {
		activityid = 21001,
		index = 9,
		recharge = 20136,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90018,
			[2] = 100018,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[406] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[407] = {
		activityid = 21001,
		index = 2,
		recharge = 20137,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[408] = {
		activityid = 21001,
		index = 3,
		recharge = 20138,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[409] = {
		activityid = 21001,
		index = 4,
		recharge = 20139,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[410] = {
		activityid = 21001,
		index = 5,
		recharge = 20140,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[411] = {
		activityid = 21001,
		index = 6,
		recharge = 20141,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[412] = {
		activityid = 21001,
		index = 7,
		recharge = 20142,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[413] = {
		activityid = 21001,
		index = 8,
		recharge = 20143,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[414] = {
		activityid = 21001,
		index = 9,
		recharge = 20144,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90019,
			[2] = 100019,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[415] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[416] = {
		activityid = 21001,
		index = 2,
		recharge = 20145,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[417] = {
		activityid = 21001,
		index = 3,
		recharge = 20146,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[418] = {
		activityid = 21001,
		index = 4,
		recharge = 20147,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[419] = {
		activityid = 21001,
		index = 5,
		recharge = 20148,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[420] = {
		activityid = 21001,
		index = 6,
		recharge = 20149,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[421] = {
		activityid = 21001,
		index = 7,
		recharge = 20150,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[422] = {
		activityid = 21001,
		index = 8,
		recharge = 20151,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[423] = {
		activityid = 21001,
		index = 9,
		recharge = 20152,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90020,
			[2] = 100020,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[424] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[425] = {
		activityid = 21001,
		index = 2,
		recharge = 20153,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[426] = {
		activityid = 21001,
		index = 3,
		recharge = 20154,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[427] = {
		activityid = 21001,
		index = 4,
		recharge = 20155,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[428] = {
		activityid = 21001,
		index = 5,
		recharge = 20156,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[429] = {
		activityid = 21001,
		index = 6,
		recharge = 20157,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[430] = {
		activityid = 21001,
		index = 7,
		recharge = 20158,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[431] = {
		activityid = 21001,
		index = 8,
		recharge = 20159,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[432] = {
		activityid = 21001,
		index = 9,
		recharge = 20160,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90021,
			[2] = 100021,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[433] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[434] = {
		activityid = 21001,
		index = 2,
		recharge = 20161,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[435] = {
		activityid = 21001,
		index = 3,
		recharge = 20162,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[436] = {
		activityid = 21001,
		index = 4,
		recharge = 20163,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[437] = {
		activityid = 21001,
		index = 5,
		recharge = 20164,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[438] = {
		activityid = 21001,
		index = 6,
		recharge = 20165,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[439] = {
		activityid = 21001,
		index = 7,
		recharge = 20166,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[440] = {
		activityid = 21001,
		index = 8,
		recharge = 20167,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[441] = {
		activityid = 21001,
		index = 9,
		recharge = 20168,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90022,
			[2] = 100022,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[442] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[443] = {
		activityid = 21001,
		index = 2,
		recharge = 20169,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[444] = {
		activityid = 21001,
		index = 3,
		recharge = 20170,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[445] = {
		activityid = 21001,
		index = 4,
		recharge = 20171,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[446] = {
		activityid = 21001,
		index = 5,
		recharge = 20172,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[447] = {
		activityid = 21001,
		index = 6,
		recharge = 20173,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[448] = {
		activityid = 21001,
		index = 7,
		recharge = 20174,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[449] = {
		activityid = 21001,
		index = 8,
		recharge = 20175,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[450] = {
		activityid = 21001,
		index = 9,
		recharge = 20176,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90023,
			[2] = 100023,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[451] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[452] = {
		activityid = 21001,
		index = 2,
		recharge = 20177,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[453] = {
		activityid = 21001,
		index = 3,
		recharge = 20178,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[454] = {
		activityid = 21001,
		index = 4,
		recharge = 20179,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[455] = {
		activityid = 21001,
		index = 5,
		recharge = 20180,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[456] = {
		activityid = 21001,
		index = 6,
		recharge = 20181,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[457] = {
		activityid = 21001,
		index = 7,
		recharge = 20182,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[458] = {
		activityid = 21001,
		index = 8,
		recharge = 20183,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[459] = {
		activityid = 21001,
		index = 9,
		recharge = 20184,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90024,
			[2] = 100024,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[460] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[461] = {
		activityid = 21001,
		index = 2,
		recharge = 20185,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[462] = {
		activityid = 21001,
		index = 3,
		recharge = 20186,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[463] = {
		activityid = 21001,
		index = 4,
		recharge = 20187,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[464] = {
		activityid = 21001,
		index = 5,
		recharge = 20188,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[465] = {
		activityid = 21001,
		index = 6,
		recharge = 20189,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[466] = {
		activityid = 21001,
		index = 7,
		recharge = 20190,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[467] = {
		activityid = 21001,
		index = 8,
		recharge = 20191,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[468] = {
		activityid = 21001,
		index = 9,
		recharge = 20192,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90025,
			[2] = 100025,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[469] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[470] = {
		activityid = 21001,
		index = 2,
		recharge = 20193,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[471] = {
		activityid = 21001,
		index = 3,
		recharge = 20194,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[472] = {
		activityid = 21001,
		index = 4,
		recharge = 20195,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[473] = {
		activityid = 21001,
		index = 5,
		recharge = 20196,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[474] = {
		activityid = 21001,
		index = 6,
		recharge = 20197,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[475] = {
		activityid = 21001,
		index = 7,
		recharge = 20198,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[476] = {
		activityid = 21001,
		index = 8,
		recharge = 20199,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[477] = {
		activityid = 21001,
		index = 9,
		recharge = 20200,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90026,
			[2] = 100026,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000311,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[478] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 602,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[479] = {
		activityid = 21001,
		index = 2,
		recharge = 20201,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[480] = {
		activityid = 21001,
		index = 3,
		recharge = 20202,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 602,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[481] = {
		activityid = 21001,
		index = 4,
		recharge = 20203,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 602,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[482] = {
		activityid = 21001,
		index = 5,
		recharge = 20204,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 50,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 602,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[483] = {
		activityid = 21001,
		index = 6,
		recharge = 20205,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 100,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 602,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[484] = {
		activityid = 21001,
		index = 7,
		recharge = 20206,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 150,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 602,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[485] = {
		activityid = 21001,
		index = 8,
		recharge = 20207,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 250,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 5,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[486] = {
		activityid = 21001,
		index = 9,
		recharge = 20208,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90027,
			[2] = 100027,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000278,
				[2] = 500,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000855,
				[2] = 10,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[487] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[488] = {
		activityid = 21001,
		index = 2,
		recharge = 20209,
		name = "10元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 10,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[489] = {
		activityid = 21001,
		index = 3,
		recharge = 20210,
		name = "18元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 20,
			},
			[2] = {
				[1] = 3022249,
				[2] = 2,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[490] = {
		activityid = 21001,
		index = 4,
		recharge = 20211,
		name = "28元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 3,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[491] = {
		activityid = 21001,
		index = 5,
		recharge = 20212,
		name = "48元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 30,
			},
			[2] = {
				[1] = 3022249,
				[2] = 5,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[492] = {
		activityid = 21001,
		index = 6,
		recharge = 20213,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[493] = {
		activityid = 21001,
		index = 7,
		recharge = 20214,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 40,
			},
			[2] = {
				[1] = 3022249,
				[2] = 10,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[494] = {
		activityid = 21001,
		index = 8,
		recharge = 20215,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 50,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[495] = {
		activityid = 21001,
		index = 9,
		recharge = 20216,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90028,
			[2] = 100028,
			[3] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000549,
				[2] = 100,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
	[496] = {
		activityid = 21001,
		index = 1,
		recharge = 0,
		name = "免费礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 601,
				[2] = 100,
			},
			[2] = {
				[1] = 56,
				[2] = 15,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 41,
				[2] = 10000,
			},
		},
		buy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		zkbuy = {
			[1] = {
				[1] = 41,
				[2] = 1,
			},
		},
		limit = 1,
		 = "免费礼包",
	},
	[497] = {
		activityid = 21001,
		index = 2,
		recharge = 20217,
		name = "10元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 5,
			},
			[2] = {
				[1] = 56,
				[2] = 30,
			},
			[3] = {
				[1] = 3000413,
				[2] = 1,
			},
			[4] = {
				[1] = 20400008,
				[2] = 1,
			},
		},
		buy = 10,
		zkbuy = 10,
		limit = 1,
		announce = 10228,
		 = "10元直购礼包",
	},
	[498] = {
		activityid = 21001,
		index = 3,
		recharge = 20218,
		name = "18元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 10,
			},
			[2] = {
				[1] = 3000861,
				[2] = 50,
			},
			[3] = {
				[1] = 601,
				[2] = 5000,
			},
			[4] = {
				[1] = 20400009,
				[2] = 1,
			},
		},
		buy = 18,
		zkbuy = 18,
		limit = 1,
		announce = 10228,
		 = "18元直购礼包",
	},
	[499] = {
		activityid = 21001,
		index = 4,
		recharge = 20219,
		name = "28元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 15,
			},
			[2] = {
				[1] = 3000861,
				[2] = 100,
			},
			[3] = {
				[1] = 601,
				[2] = 10000,
			},
			[4] = {
				[1] = 20400010,
				[2] = 1,
			},
		},
		buy = 28,
		zkbuy = 28,
		limit = 1,
		announce = 10228,
		 = "28元直购礼包",
	},
	[500] = {
		activityid = 21001,
		index = 5,
		recharge = 20220,
		name = "48元直购礼包",
		showcondition = 90029,
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 20,
			},
			[2] = {
				[1] = 3000861,
				[2] = 150,
			},
			[3] = {
				[1] = 601,
				[2] = 15000,
			},
			[4] = {
				[1] = 20400011,
				[2] = 1,
			},
		},
		buy = 48,
		zkbuy = 48,
		limit = 1,
		announce = 10228,
		 = "48元直购礼包",
	},
	[501] = {
		activityid = 21001,
		index = 6,
		recharge = 20221,
		name = "98元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020050,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 25,
			},
			[2] = {
				[1] = 3000374,
				[2] = 1,
			},
			[3] = {
				[1] = 601,
				[2] = 20000,
			},
			[4] = {
				[1] = 20400012,
				[2] = 1,
			},
		},
		buy = 98,
		zkbuy = 98,
		limit = 1,
		announce = 10228,
		 = "98元直购礼包",
	},
	[502] = {
		activityid = 21001,
		index = 7,
		recharge = 20222,
		name = "300元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020150,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 30,
			},
			[2] = {
				[1] = 3000861,
				[2] = 200,
			},
			[3] = {
				[1] = 601,
				[2] = 25000,
			},
			[4] = {
				[1] = 20400013,
				[2] = 1,
			},
		},
		buy = 300,
		zkbuy = 300,
		limit = 1,
		announce = 10228,
		 = "300元直购礼包",
	},
	[503] = {
		activityid = 21001,
		index = 8,
		recharge = 20223,
		name = "500元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020300,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 35,
			},
			[2] = {
				[1] = 3000512,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 15,
			},
			[4] = {
				[1] = 20400014,
				[2] = 1,
			},
		},
		buy = 500,
		zkbuy = 500,
		limit = 1,
		announce = 10228,
		 = "500元直购礼包",
	},
	[504] = {
		activityid = 21001,
		index = 9,
		recharge = 20224,
		name = "1000元直购礼包",
		showcondition = {
			[1] = 90029,
			[2] = 1020500,
		},
		reward = {
			[1] = {
				[1] = 3000422,
				[2] = 40,
			},
			[2] = {
				[1] = 3000516,
				[2] = 1,
			},
			[3] = {
				[1] = 3000856,
				[2] = 30,
			},
			[4] = {
				[1] = 20400015,
				[2] = 1,
			},
		},
		buy = 1000,
		zkbuy = 1000,
		limit = 1,
		announce = 10228,
		 = "1000元直购礼包",
	},
}
return config